{
  "0": {
    "Title": "Web Developer - Java, Hibernate, Spring, REST Services",
    "Description": "Web Developer - Java, Hibernate, Spring, REST Services\\r\\rOur client is looking for a Sr Web Developer to join their team.    The right person will be a strong Java developer with extensive front end experience.  Must be very strong with Hibernate/Spring, experience exposing and consuming REST style services with JSON and XML.  Strong backend database programming with SQL, strong OOD (object oriented design and development) is required.  Excellent communications skills are an absolute MUST.\\r\\rAdditional plus's are:\\rExperience with Websphere Application Server\\rFront end development with CSS, jQuery and or ExtJS\\rExperience with continuous integration process and build automation tools (Cruisecontrol, Bamboo) \\rImplemented Single Sign On with JEE Security and SPEGNO.\\r\\rIf you or someone you know is available please send us your resume and the best number to contact you\\rLocal candidates to NY/NJ only please",
    "Score": 0.9980053306
  },
  "1": {
    "Title": "ABAP Sr. Developer - Sr. Programmer",
    "Description": "\\rABAP Sr. Developer - Sr. Programmer - Information Technology Design\\r \\r\\r\\r\\rJob Responsibilities\\r\\r\\rAs an ABAP Sr. Developer, you will collaborate with User Experience (UX), Process Teams, and IT organizations on solution design – providing effort estimates based on business requirements and preparing technical specifications based on a thorough understanding of functional specifications.\\r \\rAdditional responsibilities for the ABAP Sr. Developer include:\\r\\r\\r\\r    Facilitating extended unit tests\\r    Performing code review\\r    Providing interface support\\r    Performing development quality checks\\r    Assisting with the code transport process\\r    Providing timely status reports \\r\\r ",
    "Score": 0.9938519001
  },
  "2": {
    "Title": "Sr. Oracle Database Admin",
    "Description": "Our Major Financial Client is looking for a…\\r \\rTitle: Sr. Database Administrator\\rLocation: Fort Washington, PA\\rDuration: 7 Month Contract Position/ W2\\r \\rResponsibilities: \\r** Provide support on all the stages of database implementation and/or database related deployments \\r** Participate in project meetings, as necessary, to understand application and database requirements \\r** Ability to work independently and to resolve complex Oracle issues \\r** Run diagnostic tools to identify database performance bottlenecks, and take appropriate corrective actions to improve database performance. Work with development teams to tune SQL queries. \\r** Proactive monitoring of the databases \\r** Troubleshoot Oracle performance and non-performance related issues either independently or in conjunction with other DBAs \\r** Manage backup/recovery for Oracle instances \\r** Management of database and resource capacity planning. \\r** Implement and enforce database security based upon best practice, SOX regulations, and company policies \\r** Installation of new Oracle instances and upgrades \\r** Willingness to learn the business and new technology. \\r** Provide after hours support as required \\r** Setting up and resolving issues with Oracle Data Guard environments \\r** Experience in task automation \\r** Scripting language (ksh, perl) \\r \\r \\r",
    "Score": 0.9786638021
  },
  "3": {
    "Title": "Embedded Linux Software Developer",
    "Description": "Direct Client : Leading Telecom client\\rJob Title : Embedded Linux Software Developer\\rLocation : Schaumburg, IL 60196\\rDuration : 5+ Months with possibility of an extension\\r\\rJob Details:\\rScope of Responsibilities/Expectations:\\r• Our Client is seeking an experienced Embedded Linux Software Developer to join the Software Development Team. The key responsibilities include developing drivers, libraries, and applications for the secure mobile arena.\\r• The role is to work through all phases of the software development life cycle, including analysis, design, implementation, testing and deployment. This successful candidate will work within a multi-functional team to deliver applications that meet government needs.\\r\\rBasic Qualifications:\\r• Bachelors Degree\\r• 2+ years of software engineering experience\\r• Linux experience\\r• Must be a U.S. citizen with ability to obtain necessary security clearance as required by government contract\\r",
    "Score": 0.9781934023
  },
  "4": {
    "Title": "Senior PHP & Java Developer",
    "Description": null,
    "Score": 0.9708507657
  },
  "5": {
    "Title": "SQL Developer / Systems Interface Analyst",
    "Description": "oSQL Developer \\rBrooksource is looking for a Systems Interface/Conversion Analyst to join their client on a contract to hire basis. Our client is a leading healthcare provider in the Charlotte, NC area. \\r \\rJob Summary\\r\\r    Formulates/defines system scope and objectives through research and fact-finding to develop or modify moderately complex information systems. \\r    Prepares detailed specifications from which programs are written. \\r    Designs, codes, tests, debugs, documents and maintains those programs, parameters and/or system specific adaptations. \\r    Analyzes and revises existing system logic difficulties and documentation as necessary. \\r    Responsible for completion of specific aspects of design projects. \\r    Handles multiple project tasks in order to develop, test, modify and/or deploy and support information systems. \\r    Competent to work in most phases of applications systems analysis and programming activities.\\r\\r\\rCore Processes and Activities\\r\\r    Works with project teams to perform tasks associated with all phases of corporate development methodology. \\r    Analyzes work requests and prepares design specifications for basic adaptations. \\r    Tests and debugs programs, software updates and adaptations. Tests vendor supplied processing and identifies deficiencies requiring vendor action. \\r    Prepares and maintains program, system and operations documentation. Maintains change control documentation. \\r    Facilitates implementation of new or revised functions/systems with all I/T personnel, vendors, consultants and customers. \\r\\r ",
    "Score": 0.9566340446
  },
  "6": {
    "Title": "Sr. PHP Developer",
    "Description": "GoNet has an immediate need for a solid Senior PHP Developer to join our team of consultants.  This is a long term (6 month) contract position that involves limited travel - as most work can be done remotely.  \\r \\rThe role entails coding all server-side elements on web projects of varying sizes, using primarily PHP, LAMP and Code Igniter. You will coordinate your team to develop the front-end elements on web projects.",
    "Score": 0.9471611977
  },
  "7": {
    "Title": "Application Developer - Java, SQL",
    "Description": "\\rJAWOOD is seeking a Senior Application Developer - JAVA/SQL.\\r \\r\\r    Top level technical expert in multiple specialized phases of application development. Working independently within guidelines, provides technical consulting on complex projects considering equipment capacity, limitations, operating time and desired results. \\r    Creates detailed technical designs and develops applications using existing and emerging technology platforms. \\r    Writes new systems or applications of high complexity and scope, utilizing standard procedures and techniques.\\r    Conducts analysis of organizational needs and goals for the development and implementation of application systems. \\r    Partners with business personnel to conduct analysis of organizational needs. \\r    May have senior quality assurance review responsibilities and duties including instructing, directing and reviewing work and responsibilities of other development team members. \\r    Minimum 5 years related experience preferred.\\r    Bachelor's degree in related field preferred. \\r\\r\\r\\rDUTIES \\r\\r    Creating or updating technical documentation from functional documentation\\r    Leading or assisting application solution design\\r    Creating unit test cases, creating unit test plans, conducting and/or participating in code reviews, and executing unit testing\\r    Code development, code maintenance, code promotions \\r",
    "Score": 0.9469681978
  },
  "8": {
    "Title": "CNC Programmer/ Set-Up/ Operator with Okuma Experience",
    "Description": "CNC Programmer/ CNC Set-Up/ CNC Operator with Okuma Lathe Experience\\rExcellent Pay and Benefits!!\\r1st Shift\\r\\rWorld Class machine shop in Bloomingdale, Illinois, has an immediate opening for a skilled CNC Machinist to program, set-up and operate an Okuma Lathe. This is a permanent, full time position offering excellent pay and benefits to the highly skilled Machinist who will be joining the team!\\r\\r",
    "Score": 0.9457734823
  },
  "9": {
    "Title": "C# GUI Developer - Perl - Shell Scripting - with some Java- Tibc",
    "Description": "C# GUI Developer - Perl - Shell Scripting - with some Java- Tibco - FinanceNew York, NYLong term contractCompetitive CompensationMain Function The Credit team is looking to hire an experienced developer in order to expand its' business coverage. The successful candidate will have 3+ years of hands-on development experience for server-side components for business-facing applications (such as trading systems), preferably in the Fixed Income space. The system is a rich GUI C# application with mostly Java server side. Technical Skills: \\r\\n• Programming and software development skills. *** Strong C# GUIRequired: Java, Perl, Shell scripting;  \\r\\n• Experience in the use of persistence technologies / app framework (JDBC, Spring) \\r\\n• Understanding of messaging/middleware technologies (Tibco RV, TIBCO SDK) \\r\\n• Software design skills (Object Oriented Design and Modeling, Database Design and Modeling, etc.) - Sybase, UDB, Oracle TimesTen \\r\\n• Knowledge of the Fixed Income / Repo products and trade processing knowledge, the financial markets and trading Required inter-personal Skills: \\r\\n• Results-oriented, self-starter with positive `can-do` attitude \\r\\n• Ability to effectively communicate with senior users in a global, team-based environment \\r\\n• Strong inter-personal skills with ability to communicate thoughts, designs, and implementations in both written and verbal form ",
    "Score": 0.9371317029
  },
  "10": {
    "Title": "Java Architect (POS Project)",
    "Description": "\\rJob Title: Technical Architect\\rPosition Location: Marietta, GA  \\rNormal Work Hours: 8:00am to 5:00pm \\r  \\rSummary Job Description:\\rThe Technical Architect provides technology leadership in the area of custom Java/J2EE development. The Technical Architect will focus on developing and delivering high quality enterprise applications, both as an individual contributor and as a part of a development team. He/she is responsible for creating clear and maintainable designs, code, as well as reviewing the code and designs of team members and correcting if necessary. \\r  \\rThe Technical Architect is expected to lead design and architecture discussions, and to actively participate in estimating, tasking, implementation efforts and status updates. He/she is also expected to shepherd code that has been developed through the development process and lead the efforts of planning/migrating the code into production systems efficiently.\\r  \\rThe Technical Architect will be leading or participating in on-site project teams. This role requires excellent hands-on technical skills in Java/J2EE architecture and development. This person will be working independently on complex code and performance tuning.\\r  \\rPrinciple Accountabilities (Essential Functions):\\r•          Design, develop and maintain technology solutions for automotive retail management (POS and Backoffice) systems.\\r•          Working with project and business analyst leads to develop and clarify in-depth technical requirements.\\r•          Working with senior management to establish technical soundness of the solutions.\\r•          Using and improving the productivity of the development processes.\\r•          Leading design and architecture discussions.\\r•          Working with management to estimate the level of effort, resource needs, and project duration.\\r•          Establishing and enforcing coding standards.\\r•          Evaluating tools and technologies and establishing technology standards \\r•          Troubleshooting and debugging applications and providing fixes in a timely manner.\\r•          Providing technical leadership, clarity and direction for on-site and offshore development teams.  \\r  \\r",
    "Score": 0.9268698692
  },
  "11": {
    "Title": "PC and Mac Techs – Up to $35 an hour",
    "Description": "Our firm is seeking part-time PC Technician for residential and small businesses. \\r\\rThe ideal candidate will have: \\r\\r• At least 1 year PC troubleshooting/repair experience \\r• Possess one or more of the following certifications or comparable experience: A+, Network+, MCP, MCSE \\r• Reliable transportation a must! \\r• Outgoing personality is a key! Candidates cannot be afraid to make recommendations on upgrades and solutions to our customers. \\r\\r\\rWe offer an hourly rate plus a great commission/incentive plan. On average, our techs are earning over $35/hr!  We offer very flexible schedules, with daytime, evening and weekend job opportunities available.  Please forward your resume to malmutawa@fastteks.com with the word “Delray Beach Tech\" in the subject line. \\r\\rPLEASE: No applicants above Lake Worth or below Boca Raton.",
    "Score": 0.9211232066
  },
  "12": {
    "Title": "User Interface (UI) Developer",
    "Description": "\\rUser Interface (UI) Developer\\r\\r\\rJob Description:\\r-        Create and maintain customer account management websites for prepaid debit card programs.\\r-        Follow the branding guidelines provided by the Marketing and Creative departments for each program.\\r-        Mark up the pages according to the mockups provided by Creative using CSS, XHTML, and JavaScript.\\r-        Implement and manage all the copy provided by Marketing, including internationalization.\\r-        Work with the QA team to help fix bugs and usability issues.\\rRequired skill set:\\r-        CSS\\r-        XHTML\\r-        JavaScript\\r-        Graphics editing and optimizing\\r-        JSP\\r-        Java frameworks like Spring, Struts, or JSF\\r\\r\\rExperience:\\r\\r-        4-5 years experience developing web applications using XHTML, CSS, and JSP.\\r-        Experience creating and editing simple graphics.\\r-        Experience using source control software like Subversion.\\r-        Experience with internationalization.\\r-        Interest in usability and accessibility a plus.\\r-        Successful candidate will be a self-staring team player with a collaborative work style\\rAlso prefer experience with the following:\\r-        Eclipse\\r-        Subversion\\r-        Fireworks\\r-        jQuery or similar JavaScript library\\r\\r\\r\\r\\r",
    "Score": 0.9202932119
  },
  "13": {
    "Title": "SQL Developer – Data Management Systems Engineer",
    "Description": "\\rSQL Developer – Data Management Systems Engineer – Consultant\\r\\r \\rJob Responsibilities\\r \\rAs an SQL Developer, you will design the conceptual, logical and physical data models necessary to support the analytic data requirements for various department reporting needs. This will involve independently conducting quantitative analytics. You must be comfortable working with systems as well as data.\\r \\rYour specific duties as an SQL Developer will include:\\r \\r\\r    Leading efforts in the development of new models, analytic processes or system approaches\\r    Creating documentation for all activities\\r    Working with technology staff as needed in the design of systems to run developed models\\r    Improving and streamlining processes regarding data flow and data quality to improve data accuracy, viability and value\\r    Challenging data and information integrity\\r    Working as a business partner to provide decision support to various LOB unit leaders\\r    Conducting special studies to analyze complex financial actions and prepares recommendations for policy, procedure, control or action\\r    Developing models and providing input and feedback to improve the ability to plan and control financial and business drivers\\r    Participating in the ongoing development and operations of a business intelligence architecture that enables fact-based decision making as well as ad hoc analysis and insight generation\\r    Modeling, designing and developing Operational Data Store\\r    Designing and prototyping new analyses, reports, applications and systems\\r    Enhancing old processes and defining new ones\\r    Conducting data mining and producing novel reports for management\\r    Working closely with Line of Business clients to develop and enhance SQL data base solutions \\r",
    "Score": 0.918253839
  },
  "14": {
    "Title": "Finance Systems Analyst (EAD, GC, Citizens only)",
    "Description": "\\rJob Description:\\rThe Systems Analyst will provide both Level 1 support as well as participate in projects focused on improving the business through the continued development of the financial systems. As a member of the level 1 support team, the analyst will be responsible for daily monitoring of the help desk queue and responding to tickets within the required SLAs. The analyst will have exceptional customer service skills and will be supporting all areas of the business.  \\r\\rJob Responsibilities:\\r\\r    Provide Tier 1 level support for business applications\\r\\r\\r    Answer Phone and enter tickets on behalf of users\\r    Responsible for Financial Systems Team communications\\r    Update appropriate training materials\\r    Primary participant in Command Center activities\\r    Resolve Remedy tickets within SLAs\\r    Responsible for access management configurations\\r    Strong interpersonal communication skills\\r\\r                         \\r\\r\\r\\r",
    "Score": 0.917319715
  },
  "15": {
    "Title": "SR. ORACLE DEVELOPER",
    "Description": "Digital Intelligence Systems Corporation (www.disys.com is an ISO 9001 Certified IT staffing and consulting company serving Fortune 500 and other global-scale enterprises worldwide.  Incorporated in 1994 as a certified Minority Business Enterprise, DISYS has posted an eight-year average of 50% growth per year and currently ranks as the sixth-fastest growing company in the staffing industry.\\r\\rFortune 100 company based in Charlotte, NC is currently looking for strong SR. ORACLE DEVELOPER\\r \\rSR. ORACLE DEVELOPER\\r\\rCandidate must be able to analyze problems and solve them creatively, be self-motivated and able to work with minimal supervision. Must demonstrate effective interpersonal and communication skills. Must develop a strong knowledge of products, features and services and how our customers use them. Needs the ability to handle multiple projects simultaneously, prioritize and complete specified tasks on time. Needs the ability to effectively interact and contribute to the management of relationships with off-site vendors, including offshore development teams. Needs the ability to communicate status both orally and in written form effectively. \\r\\rThe Sr. Developer will work with web and application developers and architects to define system architecture, including researching new technologies and proof of concept projects. Attend project meetings and provide input to validate system design and development. \\r\\rAs a member of the project team, the Sr. Developer will analyze software requirements to determine feasibility of design within time and cost constraints. Consult with hardware engineers and other engineering staff to evaluate interface between hardware, software and networks; and operational and performance requirements of overall system. ",
    "Score": 0.9157567024
  },
  "16": {
    "Title": "ASE Cisco Network Support Engineer",
    "Description": "JOB SUMMARY\\r\\nEngineer will provide services as the primary network engineer assigned to customer accounts in support of their network systems administration and management.  Engineer will work closely with Service Managers and internal teams to ensure that all aspects of the customer's ongoing network support and administration are successful. Engineer will be responsible for the creation and maintenance of network diagrams, custom network monitors, network RTS (Return to Service) documents, and network knowledge base articles as needed. Engineer will be available for network escalations 24x7 on an on-call basis.  Will conduct ongoing training for first line support personnel on their assigned customer's environment. Identifies and corrects recurring technical issues within their assigned customer(s) environments. Advises customer and acts as their SME (subject matter expert) for their environment for ongoing upgrades and network infrastructure improvements.\\r\\n\\r\\n•                 Works together with Network Support and Server Support engineers in support of assigned customers.\\r\\n•                 Takes responsibility for the technical support relationship for assigned customers for all network issues owned by support services.\\r\\n•                 Works break fix issues and change requests to completion while actively and thoroughly documenting all work in a ticketing system.  Schedules customer conference calls to assist in troubleshooting when needed.\\r\\n•                 Performs pro-active work within the customer environment to maintain industry standard best practices for network systems.  Documents pro-active work in a ticketing system.\\r\\n•                 Attends customer conference calls and meetings to discuss ongoing support issues. Prepares in advance to discuss open support tickets and active customer inquiries.\\r\\n•                 Identifies recurring issues for assigned customers and performs corrective action.\\r\\n•                 Reviews support tickets to ensure open cases are being handled appropriately and progress is being made.\\r\\n•                 Coordinate with various teams/customers for assistance with customer environment awareness training.\\r\\n•                 Develop deployment and upgrade strategies for OS and patch updates to network infrastructure.\\r\\n•                 Monthly audit of OS revisions and patch levels for network infrastructure.\\r\\n•                 Work directly with customers to validate, confirm and assess network connectivity requirements.\\r\\n\\r\\nREQUIREMENTS\\r\\n•                 5+ years of network experience with Cisco routers and switches.\\r\\n•                 Expert level understanding and experience with routing and switching technologies.\\r\\n•                 Expert level understanding and experience with routing protocols, specifically BGP, OSPF and EIGRP.\\r\\n•                 Expert level understanding and experience with 802.1q, STP, RSTP, MSTP, VLAN, MPLS\\r\\n•                 Expert level knowledge of firewall management, preferably with Cisco PIX/ASA firewalls.\\r\\n•                 Expert level knowledge of load balancing technology preferably with Citrix NetScaler Load Balancers.\\r\\n•                 Expert level understanding and experience with IPSEC VPN(s) tunnels.\\r\\n•                 Expert TCP/IP packet analysis, using Wireshark or raw packet captures using tcpdump.\\r\\n•                 Exceptional analytical and problem solving skills, with logical problem solving from Layer 1 through Layer 7 of the OSI model.\\r\\n•                 Strong sense of urgency in support of all customers.  Ability to understand business requirements for technical needs and utilize the business requirements information to prioritize work, develop solutions, and set urgency for others.\\r\\n•                 Ability to follow policies and procedures that dictate minimum standards for ticket handling, such as customer communication status updates, timelines for escalation, management communication status updates, etc.\\r\\n•                 Understanding of overall business functions and the impact of technical decisions on business results.\\r\\n•                 Exceptional planning skills and ability to work within change control parameters.\\r\\n•                 Demonstrated commitment to providing customer-focused quality service. \\r\\n•                 Experience with high availability environments with 99.99% SLA.\\r\\n•                 Ability to express complex situational information verbally and in written form.\\r\\n•                 Excellent oral, written and interpersonal communications skills.\\r\\n•                 Exceptional documentation skills are required.\\r\\n•                 Ability to complete tasks with minimal supervision.\\r\\n•                 Ability to work well under pressure.\\r\\n",
    "Score": 0.912686348
  },
  "17": {
    "Title": "Lead PHP Developer",
    "Description": "*This is contract to hire so MUST be a US Citizen or a Green Card holder\\r* It is phone interview first then face to face interview\\r* Client will pay for relocation for the right candidate\\r\\rLocation: Union Square\\rManager is located in CA, but the job is in NYC. Relocation will be considered for the right candidate. They are targeting people coming out of Yahoo because they use similar technology.\\r \\rLead Software Engineer (PHP), NY \\r \\rResponsibilities:\\r\\r\\r\\r    BS in Computer Science or related technical discipline; MS or PhD preferred. \\r    10 to 15 years experience in a Software Development role.\\r    5+ years experience in high-traffic internet-facing environment; solid experience engineering robust web-based prototypes and production systems that can support millions of active users.\\r    Current or former role acting as the development owner of an application or user interface; as comfortable making technical decisions around architecture or design patterns as you are representing the engineering team in discussions with project management, business teams, and organizational leadership.\\r    Background in engineering end-to-end solutions that utilize distributed systems and network system architecture to accommodate 24/7 operation.\\r    Expert level background in Object Oriented Programming with PHP5+.\\r    Experience working with high-volume Oracle or other object-relational database management systems.\\r    Ability to optimize DML and PL/SQL for scalability.\\r    Several years experience with Model-View-Controller (MVC) separation; PHP Symfony framework specific experience highly recommended as it’s our PHP framework of choice.\\r    Well-versed in unit test creation and working with continuous integration environments such as Jenkins and Cruise Control.\\r    Extensive experience with Unix/Linux, Web Services (SOAP/REST), XML/XSL, AJAX, JavaScript, JQuery, HTML, CSS; frontend web design experience.\\r    Strong verbal & written communication skills.\\r    Ability to work in a fast-paced deadline-driven environment.\\r    Participation and interest in software development industry trade conferences, seminars, and/or training.\\r    Experience, knowledge, and discipline in standard system development lifecycle practices including translation of business requirements into a system design document, source code version control (CVS, git, etc.), and maintenance, to name a few.\\r    3+ years experience working in agile environment (Scrum, Lean, or XP).\\r    Experience with Pair-Programming and Test-Driven Development.\\r    Previous experience conducting and participating in code review sessions.\\r    Project Management experience or formal training is a plus.\\r    Comfortable partnering with requirement specialists and quality assurance personnel to ensure implementation is to specification and meets the needs of the business.\\r    Ability to work with a diverse team of highly motivated software developers of varying skill set, background, and geographical location.\\r    Experience leading and mentoring junior level staff; offshore talent management, a plus.\\r",
    "Score": 0.9087433219
  },
  "18": {
    "Title": "Senior Java Web Application Developer",
    "Description": "Solutionreach, the pioneer in text and email messaging to patients, is the leader in providing soup-to-nuts patient engagement and communication solutions.  Utilizing the latest text, email, voice, video, web, and social media tools, Solutionreach equips healthcare providers with a “high-tech\" solution that does not sacrifice “high-touch\" personalization. \\r\\r\\rSolutionreach is looking for Senior Java Web Application Developers to assist us in making our award-winning and amazing service even more awesome.\\r\\r\\rYou will, among other things: \\r\\r    apply front-end web, Java, database and Linux skills and have an immediate, noticeable impact on the company’s products and customers.\\r    perform unprecedented heroics in architecture and scalability, helping the engineering team grow the company’s software offerings to support a rapidly increasing customer-base.\\r    collaborate with product managers to comprehend and prioritize customer feature requests. \\r",
    "Score": 0.9069163203
  },
  "19": {
    "Title": "SQL Server Architect - Washington D.C. - $105K - $120K",
    "Description": "SQL Server Architect – Washington D.C. - $105K - $120K\\r\\n\\r\\nUnbelievable opportunity with an industry-leading, international Dynamics GP end user headquartered out of Arlington, VA.\\r\\n\\r\\nThis will be an unparalleled chance to step into a well-established IT Department (6 .NET Developers and 2 DBAs), whose budget has gone from $450K to $2 million over the past 2 years.\\r\\nWith several long-term projects set to kickoff in the summer, you will bring an expert level knowledge of MS SQL Server architecture and initially get your hands on an upgrade to SQL Server 2012.\\r\\n\\r\\nYou must have 5+ years MS SQL Server experience in development or architecture (re-designing database workflow, re-engineering database map, heavy migration of data etc.) and extremely strong communication skills.\\r\\nBeing a Dynamics GP end user, experience with Great Plains or other ERPs will be a MAJOR plus!\\r\\n\\r\\n$105,000 - $120,000 base + 401K + company laptop and cell phone.\\r\\n\\r\\nSerious candidates need apply directly and call Max on 212-731-8272 ASAP.",
    "Score": 0.8982858062
  },
  "20": {
    "Title": "Oracle Developer - High Performance Trading System",
    "Description": "\\rMy client is the leading and most widely adopted Credit Default Swaps (CDS) trade workflow and connectivity provider, offering full support for all the cleared and OTC transactions. Market participants benefit by electronically affirming trade details within moments of having executed the deal. \\r",
    "Score": 0.8956452608
  },
  "21": {
    "Title": "Sr Java UI Developer - JSF",
    "Description": "\\rSr Java UI Developer (JSF)\\r \\rSeeking a seasoned Sr Java UI Developer (JSF) on a contract to hire basis for our retail client in Johns Creek. Candidates should have VERY strong front end web development experience. It is imperative that they have worked in conjunction with a User Interface Designer. The Java UI Developer will NOT be designing the web site but developing the wireframes into code that can be used by Java development team.\\r \\r Required Skills:\\r\\r    5 years of hands-on UI development experience using Java Server Faces (JSF) implementations like Rich Faces, JQuery, JSP, AJAX, Java Script, XHTML, CSS and JSTL\\r    Experience using RAD and/or Eclipse as a development work bench\\r    Experience using ClearCase, WebSphere, DB2 and Hibernate\\r    Experience using various design patterns preferably MVC\\r    Strong interpersonal and communication skills.\\r    Problem solver with attention to detail.\\r    Self-motivated with strong time management skills and able to handle multiple assignments\\r\\r \\rLocation: Johns Creek, GA \\rBase Pay: Competitive\\rJob Type: 3 Month Contract to Hire\\r\\r\\r",
    "Score": 0.8945984244
  },
  "22": {
    "Title": "Lead Programmer Analyst (Java Enterprise Architect)",
    "Description": "Lead Programmer Analyst (Java Enterprise Architect) \\r\\r\\rAt Subaru of America, our work is a reflection of who we are.  We care about the cars we build, about each other, and about the world we live in.  It's why we've created a positive, award-winning work environment for our employees with a great variety of career opportunities and the training and support to help them succeed. \\r\\r\\rIn this position your primary responsibilities will include designing and developing the software components that drive Subaru of America’s multi-tier web environment.  This person will create distributed applications and services, develop back-end API specifications for downstream system interfaces, and will be responsible for design and development of various aspects of core application services. The Lead Programmer Analyst will be responsible for web and middleware engineering activities for development, test and production environments.  Responsibilities will also include acting as a knowledge expert and liaison to other areas within Subaru’s Information Technology for web-based technologies.\\r\\r\\rThe ideal candidate will possess a BA/BS degree in Computer Science (Masters degree in Computer Science a plus) with 6 to 8 plus years of overall development and 3 to 5 plus years of enterprise software experience. The Lead Programmer Analyst must have excellent verbal communication, written communication, and social interaction skills.\\r\\r\\rThis candidate must be open to providing off-hours production support.",
    "Score": 0.8944789767
  },
  "23": {
    "Title": "Senior Java Developer (Mobile | Web Apps)",
    "Description": "Classification:   Software Engineer\\r\\n \\r\\nCompensation:   DOE\\r\\n \\r\\nSenior Java Developer (Mobile / Web Apps) Los Angeles, CA\\r\\n\\r\\nThe Role\\r\\n\\r\\nAs Senior Java developer you are responsible for leading a team to create and implement high quality software. Ideal Java candidates will also be responsible for reviewing the requirements, designing, implementing, testing and deploying mobile Java application software that promotes reuse and system-wide scalability.\\r\\n\\r\\nCandidates must have the ability to un most aspects of a project(s) from end-to-end (full cycle). They must be able to interface with the product design staff, architect a solution, estimate project time line and requirements, lead a team in the execution of their plan and interact with the QA and operations groups to ensure timeliness and quality of project delivery. \\r\\n\\r\\nThe ideal candidate will be able to mentor and conduct hands-on code reviews with junior developers and they will work with their peers to develop long term architectural strategy. Experience working with offshore or remote teams is a plus.\\r\\n\\r\\nGeneral Overview\\r\\n\\r\\nIdeal candidates have experience with the following:\\r\\n\\r\\r\\n• Energetic and self motivated\\r\\r\\n• Empowered to maintain/achieve high performance standards\\r\\r\\n• Working in a fast paced, complex environment \\r\\r\\n• Working with off-shore development teams \\r\\r\\n• Project/Team leadership\\r\\r\\n• Gels well with development and cross-functional teams (a true team player)\\r\\r\\n• Provide mentorship in areas of expertise\\r\\r\\n• Coachable and open to learning new experience(s)\\r\\r\\n• Problem solver",
    "Score": 0.8929716945
  },
  "24": {
    "Title": "PHP / Backend Developer",
    "Description": "TapIt! Media is seeking talented, creative and motivated individuals to support our software development efforts. Responsibilities include the design, development and support of software and business critical systems for our various product offerings.\\r\\rResponsibilities:\\rDesign and develop software for key system components including ad server, reporting,optimization, and analytics\\rAssist in the design and development of new services in accordance with technical roadmaps\\rSupport operations engineering staff with troubleshooting\\rCommunicate project status to stakeholders throughout the business\\rPerform other activities and duties as requested\\r\\rWe are headquartered in Irvine, CA. \\r\\rClick here for our website.\\r\\rWho We Are:\\rTapIt is a mobile advertising company that enables the banner and video advertisements you see inside your iPhone and Android phones. We facilitate ads both inside mobile applications and mobile web, where users will see the advertisements while playing their favorite game or reading their favorite news site. Our advertisers range from eBay and Google to the Top 25 iOS Applications.\\r\\rWho we work with\\rMcDonalds, Angry Birds, Fruit ninja, Univision and many more!\\r\\rNeed More?\\rWe value culture heavily at our company, and evaluate strongly how & what candidate bring to the company and environment. We have a fun office, wonderful location, amazing co-workers & a very bright future. It is all made in part by the wonderful staff as well as our executive leadership. Click here to check out our blog!\\r",
    "Score": 0.8906112909
  },
  "25": {
    "Title": "Cognos Developer / TM1 Programmer",
    "Description": "• The primary focus of this role is the ongoing and future development of current and new TM1 modules. The position is directly responsible for building and maintaining TM1 solutions and requires hands on and in depth experience with the product. Knowledge of planning, budgeting, and forecasting functions as well as business processes is also required. • Other responsibilities include: o SharePoint 2010 Designer responsibilities. o Manage/create new site collections, workflows, InfoPath forms and security. o Manage current and future Business Unit Intranet integration projects to the SharePoint portal. o Other duties as assigned. \\r\\r",
    "Score": 0.8883646727
  },
  "26": {
    "Title": "Sr. Java Developer",
    "Description": "\\r\\r\\rSr. Java Developer \\rThe Senior Java Developer will assist in the design, development, testing, and maintenance of J2EE (Java Platform Enterprise Edition) based solution. The position requires the ability to analyze and understand requirements, hands-on implementation of the requirements with existing and emerging J2EE (Java Platform Enterprise Edition) technologies and good communication skills. This position will interact with a wide array of disciplines including Product Management, Operations, Engineering, Quality Assurance, etc. in a team atmosphere with the goal of bringing new products to market as well as maintaining existing products.\\r\\rPrimary duties and Function:\\r\\rIn Development - Participate as needed in the development and implementation of Java software based on approved design. Write new programs or create modifications to existing applications as necessary based on project requirements. Follow established standards for the design, coding, and testing of software. \\rIn Testing - Review test plans, test files, and scripts for unit testing through integration testing. Work with users to validate system testing and conformity with functional requirements. \\rImplementation- Follow appropriate change management and implementation procedures. Ensure that appropriate technical and functional documentation is prepared. Coordinate the implementation process. \\rSupport- Provide guidance on technical troubleshooting and coordinates support with vendors and internal support teams. Provide support to new applications during and after implementation. \\r\\r\\r\\r\\r\\r",
    "Score": 0.8870127201
  },
  "27": {
    "Title": "Manager, ATG Software Development",
    "Description": "\\r\\r\\r\\rManager of Software Development \\r\\r \\r\\rSPEED is committed to being a leading provider of end-to-end e-commerce services for retailers and manufacturers. Our mission is to grow our clients’ businesses by focusing on consistently doing the right thing for each brand, providing flexible solutions, responsive processes, and high-performing services every day, for every client.\\r\\rWe're looking for YOU, our next Manager of Software Development, to join our winning team\\rThe Manager of Software Development (MSD) is responsible for all software product development and production support activities for the company’s Dallas, Texas Development Center. The MSD is responsible for the direct-report development staff members in the Speed FC.  The MSD works within an environment of rapid growth and must anticipate and respond effectively to needs as they emerge.  This leader is expected to represent the IT department in a positive manner, provide creative thinking and solutions, actively contribute to the growth of the company and deliver quality work products in a timely fashion.\\r\\r \\rThe MSD reports directly to the VP of Software Development and works closely with other functional leaders in the company, including Senior Director of Onboarding, Director of Software Development, Customer Service, CIO, CTO and CEO.  This position will also periodically interact with both existing and prospective clients in crafting solutions that meet or exceed requirements, are solid investments for SPEED and represent architectural excellence.  The MSD works on an ongoing basis with the Software Development leadership, CTO and Infrastructure leadership on the SPEED technical architecture.  \\r\\r\\r    Provide strong, positive day to day leadership for department’s software development activities\\r    Provide technical direction and guidance, as well as hands-on management, for department’s product development\\r    Work closely with the other Development Leaders, Business Analysis, Project Management, Client Services, and Test/QA to ensure that business requirements are clearly understood and delivered – on time and within budget  \\r    Ensure the optimal application of technology and engineering resources to meet product development and/or customer requirements, per the product and/or marketing requirements document\\r    Ensure that software products are fully and correctly defined and documented\\r    Promote/hire and direct a staff of software developers to meet scheduled commitments and quality project deliveries\\r    Implement appropriate processes to support agile product development process\\r    Mentor, train and lead staff in best practices of software development\\r    Provide accurate task and project estimates to completion\\r    Create a rewarding workplace and a highly motivated development staff\\r",
    "Score": 0.8860846162
  },
  "28": {
    "Title": "Sr. IT Project Manager - Agile Professional",
    "Description": "\\rGENERAL DESCRIPTION: \\r\\rUnder general direction, oversees the installation and client acceptance of capitalized equipment, enterprise software system, or system integration project or engagement. Provides on-site day-to-day activities between client and company personnel. Ensures customer satisfaction of information technology solutions by managing the details of overall project schedules and deliverables. Typically uses more project management skills than technical skills. Services may be provided on a fee-for- service basis or be included as part of the purchase price for company products. Plans and manages schedules and budgets. Monitors the project from initiation through delivery. Organizes the interdepartmental activities ensuring completion of the project/product on schedule and within budget constraints. Develops and manages the project plan, including project scope, development/delivery schedule, resource requirements and integration efforts; Develops and manages a communication plan to include content, frequency, audience and channels; Works with management staff to establish appropriate project structure and staffing plans and participates in the staffing process. Sets goals, objectives and priorities; assigns and reviews work, resolves conflict. May provide input on performance against deliverables. Manages resource additions and deletions over the life of the projects; Interfaces with the customer, internal or external, regarding project deliverables. Accountable for meeting project schedules and costs; Ensures that approved methods, processes and tools are consistently used, include change, issue risk and quality management. \\r\\r\\r\\r",
    "Score": 0.8858027458
  },
  "29": {
    "Title": "Java / J2EE Senior Developer -IT Project Consultant",
    "Description": "\\r\\rApex Systems is currently seeking Java Developers to work in multiple locations throughout the U.S. We are seeking Java Developers of all levels who are open to both temporary project based relocation as well as permanent relocation. We currently have Java Developer openings for contract, contract to hire, and permanent employees. We have provided a basic description of the requirements for your review below. This description covers 80% of the requirements that we typically look for in our Java Developers. Apex offers competitive market rates, generous benefits packages, as well as travel expense reimbursement for most of our projects. If you are interested in hearing more about specific job opportunities, please apply to this job posting and we will contact you as soon as we receive your resume.\\r\\r \\r\\rJava Sr. Developer-IT Sr. Programmer-Software Developer/Designer\\r\\r \\rJob Responsibilities\\r\\r\\r\\rAs a Java Sr. Developer, you will be responsible for developing new code, feature enhancements, and multi-tier development. You may also be required to lead junior software developers in the development process – ensuring the quality of their work meets industry standards and directing them through common struggles. \\r \\rAdditional responsibilities for the Java Sr. Developer include:\\r\\r \\rAdditional responsibilities for the Java Sr. Developer include:\\r\\r    Writing complex software code\\r    Leading code and design reviews\\r    Designing and executing software tests\\r    Identifying and reporting software problems\\r    Developing software trouble reports\\r    Debugging and validating fixes \\r\\r\\r \\r\\r",
    "Score": 0.8824931979
  },
  "30": {
    "Title": "Sr C# Developer",
    "Description": null,
    "Score": 0.8810661435
  },
  "31": {
    "Title": "Data Analyst with Advanced MS Excel!",
    "Description": "Volt has partnered with a leading company automotive manufacturer in Irvine to help identify an experienced Business / Project Analyst for an immediate opportunity. In this position you will be responsible for pulling data from automotive databases, running ad hoc reports, and using advance functions of MS Excel including conditional formulas and V look up. This position is a temp position, expected to last 10 weeks. Pay is $25-28/hr. To apply, submit resume today.\\r\\n\\r\\nVolt is an Equal Opportunity Employer.",
    "Score": 0.8753339648
  },
  "32": {
    "Title": "Front-End Developer - DIRECT HIRE",
    "Description": "Front-End Developer - DIRECT HIRE\\r\\nObject-Oriented JavaScript, CSS/HTML/HTTP\\r\\nCross-Browser Requirements, UNIX, Python\\r\\nVolt Technical Resources has a Direct Hire opportunity available in NYC for a Front-End Developer.\\r\\nDuties and Responsibilities:\\r\\nWork with the Project Manager on Application Design and Development.\\r\\nDevelop:\\r\\nApplications\\r\\nWeb-based software\\r\\nComponents and services using HTML, CSS and JavaScript\\r\\n\\r\\nThis is a Direct Hire position, through Volt Technical Resources, based in New York City. We are among the largest staffing companies in the US for contingent/temporary and direct hire placements, and support most of the top-rated companies on the East Coast.",
    "Score": 0.8725680113
  },
  "33": {
    "Title": "Senior SQL Server Developer",
    "Description": "As part of the Ryder team, the ETL Developer / Consultant will perform a variety of job functions.\\r\\nBachelor's degree in Information Technology, Computer Science or 8 years related work experienceA Minimum 5 (five) years experience developing SQL Server 2000/2005 databases-3+ years of experience in developing and supporting stored procedure, DTS and SSIS packages\\r\\n•Experience in other ETL tools like Informatica or DataStage is a big plus\\r\\n•Experience in repoting tools like Microsoft Reporting Services or Microstrategy is a plus\\r\\nWork with key members of various departments to determine the definitions of essential data elements.Understands:\\r\\n     a. Data Warehousing theory and techniques\\r\\n     b. ETL techniques, including the development of staging areas, recoveries, data cleansing, fact and dimension tables, slowly changing dimensions, conformations, and the use of surrogate vs. natural keys.\\r\\n     c. Advanced SQL\\r\\n     d. That the end user is the primary reason for the technology, and therefore strives for full customer satisfaction.Develop robust and precise ETL routines to load the Data Warehouse from various sources.Designs and writes the scripts required to extract, transform, load (ETL), clean, and move data and metadata so it can be loaded into a data warehouse, data mart, or data store.Works with the Business Intelligence Analyst to identify and understand source systems to meet business requirements.Maps source system data to data warehouse models.Develops and tests for extraction, transformation, and load ETL processes.Defines and captures metadata and rules associated with ETL processes.Adapts ETL processes to accommodate changes in source systems and new business user requirementsResponsible for troubleshooting ETL job failures during regular business and after hours.Responsible for developing custom scripts to support ETL and other special needs. Will act individually or as a member of a project team to formulate business requirements and providing solutions design. Will be joint responsible for the success of the EDW/Business Intelligence solution by working together with the other team members.\\r\\n\\r\\nRyder is proud to be an Equal Opportunity Employer and Drug Free workplace.",
    "Score": 0.8646587729
  },
  "34": {
    "Title": "Sr. Software Implementations Engineer ??? Healthcare IT",
    "Description": "Job Title: Senior Software Implementations Engineer ??? Healthcare ITLocation: Montvale, NJ 07645Job ID: BHJOB1422_321Type: Contract (Possibility of converting to full-time employee)Duration: 6+ MonthsCompensation: Based upon ExperiencePosition Summary:Our client is a nationally recognized healthcare technology firm and has turned to Sound Advice to help them identify, qualify and present qualified individuals for this critical position (see below).  \\r\\n• This is a highly visible client-facing position that requires interaction with all levels of management. \\r\\n• Responsibilities include onsite software installation management, network analysis and design, application testing, database administration and troubleshooting. \\r\\n• This position requires at least 50% travel to client locations, plus the ability to efficiently track and manage multiple software installation/implementation projects.Responsibilities\\r\\n• Exercises sound judgment based on prior experience and application knowledge to recommend complex network solutions under limited or no direct supervision.\\r\\n• Provides high level technical consultations and support on EHR, PM and PACs efficiency through phone, WAN and onsite presence.\\r\\n• Project management of application installations and upgrades in complex network environments that employ strict security policies\\r\\n• Acts as the primary technical liaison between our organization and assigned clients\\r\\n• Utilizes knowledge and experience to provide enterprise level support of EHR, PM and PACs installations. This includes implementing recommended configurations at client locations for optimal performance of LAN and WAN.\\r\\n• Designs network infrastructure in Active Directory and DNS in order to apply appropriate security policies, or make recommendations to clients.\\r\\n• Create, test and validate group policies and scripts for software deployment in an enterprise environment. \\r\\n• Record and track support problems in help desk software while keeping all stake holders informed of problem status and estimated resolution times. \\r\\n• All other duties as assigned by the Chief Information Officer.Requirements\\r\\n• Must possess a 4 year degree from an accredited institution\\r\\n• Must possess advanced technical certifications or have equivalent work experience (MCSE, MCITP, CCNA preferred). \\r\\n• Must have at least 5 years experience working with enterprise database platforms such as SQL Server or Oracle. \\r\\n• Must have at least 5 years experience installing and supporting software applications. \\r\\n• Must have advanced skills in designing and supporting network infrastructure (domain controllers, application servers, Citrix, Terminal Server, DNS, firewalls, routers, switches).\\r\\n• Must have excellent customer relations skills and ability to communicate effectively with all levels of client organization.\\r\\n• Ability to work on diverse projects under tight deadlines.\\r\\n• Ability to assess problems, recommend appropriate solutions, and implement them. \\r\\n• Able to create accurate and coherent documentation for distribution to end users.\\r\\n• Above average skills with MS SQL a definite plus.Physical Requirements\\r\\n• Ability to lift boxes or equipment weighing up to 75 LBS.\\r\\n• Ability to work in spaces with less than 30??? of headroom, while in a kneeling or seated position.\\r\\n• Ability to travel via auto or plane to client locations or trade shows as needed. Education: Bachelors in Computer Science or equivalent  If you???re viewing this position outside of the soundadvice.jobs web portal please apply http:// http://saj.cc/acme321. If you would like to see additional opportunities we have available please visit the Sound Advice Job Board. SORRY * NO VISA TRANSFERS OR SPONSORSHIP AT THIS TIME  About Sound Advice:Sound Advice Consulting Services LLC (Sound Advice) is a premier consulting, talent acquisition, and recruitment process outsourcing (RPO) firm dedicated to satisfying our clients' needs for high quality - and often very hard to find - talent. Our principal objective is to provide clients with cost effective contract consulting, direct hire / permanent placement, and RPO resources that will enable them to successfully achieve their business goals and objectives. We are amongst the industry leaders in providing Agile/Scrum Professionals in support of product development and project management initiatives. We specialize in providing resources for such functional roles as Scrum Masters, Project Managers, Business Analysts, Quality Assurance (QA) Analysts, User Interface (UI) Designers and Engineers, Software (SW) Developers/ Engineers, and Database Administration (DBA). Our industry focus is primarily in Healthcare IT / Life Sciences (Health Care and Pharmaceuticals), Financial Services IT, and IT Management / Consulting.  Sound Advice professionals have nearly fifty years of combined industry experience serving clients throughout the United States. For more information about our firm or any of our service offerings, please contact us at 877.707.7227 (877.707.SACS) or 212.679.7227, or visit us on the web at www.soundadvice.jobs. To see all of our current/open position please visit the Sound Advice Job Board.",
    "Score": 0.8637154102
  },
  "35": {
    "Title": "Teradata Developer",
    "Description": "We are currently seeking a Senior Teradata Developer for a full-time position in Virginia Beach, VA.  This opportunity is with a cutting edge/growing company that takes pride in their employees and their well-being.  Flex hours are allowed, and a healthy work-life balance is insisted upon.  Opportunity includes a full list of benefits.\\r\\r\\rRelocation is available.\\r\\r\\rMust be able to work W2 (US Citizen, Green Card holder or EAD in Green Card Process) ",
    "Score": 0.8611031175
  },
  "36": {
    "Title": "Analytics Software Tester 2",
    "Description": "Analytics Software Tester 2  SAS- the market leader in providing a new generation of business intelligence software is seeking an Analytics Software Tester 2 at our facility in Cary, North Carolina.  Candidate will validate numerical accuracy and verify business usage patterns relating to optimization solutions within the SAS Retail Suite. Participate in verification of numerical accuracy and validation of implementation to correctly solve business problems, determine how solution will be integrated into customer's business process, and evaluate usability given the defined personas. Work closely with many levels of development staff. Understand both the optimization algorithm and the business problem being solved. Create sample data to provide complete coverage of optimization features. Provide analysis of testing coverage. Exercise software from user interface through SAS and C code analysis. Research technical literature. Maintain test programs and scripts. Participate in documentation process. Provide feedback to developers on product design and performance.  Requires a Ph.D. degree in Operations Research, Industrial Engineering, Mathematics or related field of study. A Master's degree plus 2 years experience in the position offered or as a Technical Student or TA may also be accepted. Must have demonstrated experience or knowledge of at least one programming language; optimization concepts and methodologies including linear and integer programming; nonlinear programming; UNIX and/or Windows operating systems; software testing techniques and the use of automation tools; variety of optimization models and methods, preferably focusing on a heuristic approach; Structured Query Language (SQL) and databases like DB2, Oracle; SAS Programming including use of some SAS Macro; SAS/OR, CPLEX, Dash, AMPL, GAMS, SNOPT, SOQO; optimization techniques in a retail environment; and experience writing or testing commercial grade software required. Experience or knowledge may be gained concurrently or as part of educational curriculum.\\r\\n\\r\\nTo apply, go to www.sas.com/jobs and submit your resume to Job Number 12001639. EOE/AA Employer. Drug free work environment - screening required.   Source - News & Observer",
    "Score": 0.8594346046
  },
  "37": {
    "Title": "Project Manager (Sftw Dev OR Web)",
    "Description": "Our client is seeking a dynamic Project Manager to join their team.  The successful candidate will report to the Director of Information Technology and be responsible for supporting the development of a new company website.  This Project Manager will coordinate the planning, design, and implementation activity to deliver the new website. Under direction, the incumbent defines the deliverable, timelines, and milestones of the project, and coordinates the development activities between the project team and the external vendor commissioned for the project.   These tasks require a combination of expertise in managing software development projects, full understanding of system development life cycle (SDLC), in-depth project management experience, and excellent communication skills.   Responsibilities IncludeRunning complex projects from design and development to production.Manage all phases of SDLC, and liaise with business users, technology staff, and external vendor.  Develop project plans, including scope, goals, objectives, timeline, milestones, tasks, etc. Defines resources and schedule for project/program implementation. Own the project schedule; Manage timelines and deliverables using standardized project management tools, e.g. MS project, SharePoint team site, etc.  Facilitate requirements gathering and the development of functional specifications, and technical specifications. Design and maintain technical and project documentation required by SDLC including requirements document, project and resource plans, project plan updates, presentation materials, test plan, launch plan, etc. Assist in reengineering business processes, document new processes and obtain buy-in from business stakeholdersCreate strategies for risk mitigation and contingency planning. Efficiently identify and facilitate project issues resolutions. Coordinate and track project deliverables from multiple teams.  Prepare weekly project status. Assist in managing financial resources for projects In today’s job market, “who you know” matters more than ever – and that’s why you should get to know Volt. We’re one of the world’s largest recruiting companies, yet our success is built one successful placement at a time. Each of our recruiters has niche industry expertise, committed to connecting top talent with respected companies.For more opportunities, connect with us online at volt.com/NorCal. Volt is an equal opportunity employer.",
    "Score": 0.8586253524
  },
  "38": {
    "Title": "Sr. Software Developer",
    "Description": "Posted Date:   4/19/2012\\r\\n \\r\\n Summary: Analyze and translate business requirements into technical specifications. Design and develop multi-tier distributed applications in a Windows/Internet environment and maintain or enhance existing software. Test and debug applications; identify, track and resolve defects. Responsibilities: Consult with internal clients using active listening and probing questions to develop an accurate and complete understanding of their business needs and problems.Perform needs analysis to determine the most strategic changes for customers to make including writing a “case for action” that identifies purpose and scope of changes.Understand and apply the basic principles of process analysis, mapping, and modeling to system development and implementation.Translate customer requirements into key design principles, detailed module specifications, system characteristics and application design.Identify and describe key transaction characteristics (e.g., inputs, processes, outputs, volumes, etc.)Develop and consistently apply key criteria for data integrity (e.g., availability, utility, confidentiality, reliability, etc.)Write code, complete programming, and perform testing and debugging of applications.Create or modify user acceptance test plan (reconciliation plan) to ensure business processes and user requirements are modeled and evaluated in the new system, and that new system functions effectively.Log and track defects and problems to ensure they are resolved; document and communicate methods of resolution for future reference to eliminate recurring problems.Identify cause/effect relationships and address root causes of problems wherever they exist.Establish feedback mechanisms and procedures for new system development to identify problems and enhancement opportunities.Establish specific security requirements for all development initiatives and document security plans and procedures.Develop and apply ongoing methods for preventing, identifying and correcting security problems.\\r\\n \\r\\n  Qualifications: Organized and detail-oriented, able to work well under deadlines in a changing environment and perform multiple tasks effectively and concurrently.Robust knowledge of standard application architectures such as MVC, MVVM and standard software design patterns.Excellent communications skills, both verbal and written, including excellent technical writing and customer service skills.Able to work effectively under pressure, independently, and within a collaborative team oriented environment using sound judgment in decision making. Experience / Education: Bachelor’s degree in Computer Science, a related field, or equivalent education required, 5 or more years of experience in software development which includes at least 3 years in .NET (C#, ASP.NET, Ajax, WCF, Silverlight), 3 years in MS SQL Server 2005/2008, and 2 years in JavaScript, HTML, CSS is required.Experience in multi-threaded and asynchronous programming a plus. Physical Demands and Work Environment: Representative of those that must be met by an employee to successfully perform the essential functions of this job. Must be able to operate a PC and sit for extended periods of time. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.  ~cb~ In addition to career advancement opportunities and a fun work culture, Esurance offers comprehensive medical, dental, vision care and supplemental life insurance benefits for you and your family, a competitive compensation package along with a Performance Bonus, company matching 401(k) plan, and immediate tuition reimbursement from the start of your employment.",
    "Score": 0.8577857614
  },
  "39": {
    "Title": "Senior Software Engineer (Java, SOA, Real Time Protocol)",
    "Description": null,
    "Score": 0.8551008701
  },
  "40": {
    "Title": "Tester - Performance Tuning - HP TruClient/HTTP Vuser Generator",
    "Description": "Tester - Performance Tuning\\r\\nHP TruClient/HTTP Vuser Generator\\r\\nHP LoadRunner Test Design/Implementation/Analysis\\r\\nPerformance Monitoring, JSF/Java\\r\\nApplication Tests/Profiling, Portal\\r\\nIBM WebSphere Middleware, Web/EJB Container\\r\\n\\r\\nPAY RATE: $35/HOUR\\r\\nVolt Workforce Solutions has a long-term Tester position available in Albany, NY.\\r\\nPosition Description:\\r\\nThis position will be responsible for:\\r\\nWorking with Development teams to design and implement Load Runner Application Test scenarios.\\r\\nExecuting the scenarios.\\r\\nAnalyzing test results with the HP suite of Application Test and Resource Monitoring tools.\\r\\n\\r\\nAdditionally, the Tester will be responsible for timely submission of reports to all responsible parties.\\r\\nDuties and Responsibilities:\\r\\nThe Tester will:\\r\\nWork with competing Development teams to schedule exclusive and non-exclusive use of testing environment(s), resolving conflicts and notifying key monitoring resources/teams of Application Test schedule changes.\\r\\nBe responsible for Performance Monitoring and tuning Java Applications in the Integrated Justice (IJ) Portal infrastructure.\\r\\nAdvise Administrators on Application Resource utilization impacting system performance, response times and throughput.\\r\\nInvestigate/troubleshoot abnormal conditions within the test scenarios.\\r\\nWork with appropriate teams to remedy any problems.\\r\\n\\r\\nThis is an estimated one-year PLUS contingent / temporary position in Albany, NY, through Volt Workforce Solutions, based in Raleigh, NC. We are among the largest staffing companies in the US for contingent/temporary and direct hire placements and support most of the top rated companies in the US.",
    "Score": 0.854354322
  },
  "41": {
    "Title": "Linux / Virtualization / Server Lab Technician",
    "Description": "We are looking for someone to configure mobile, desktop and server solutions in any number of hardware configurations, and execute industry standard, proprietary and custom tests against multiple operating systems.  Troubleshoot, diagnose and report failures and work towards pinpointing solutions. Keep detailed notes, write/maintain Standard Operating Procedures, maintain accurate inventory, and keep an organized work environment.\\r\\n\\r\\nYou will be running servers and virtual servers with different operating systems to allow the team to study how the servers and prototype servers react in the different environments\\r\\n\\r\\nThe ideal candidate will have experience setting up servers and virtual servers plus have a thorough understanding of the hardware (on the component level) in a lab environment.\\r\\n\\r\\nIt is preferred that the candidate have extensive hardware knowledge to go with the software experience.  Over 60 years of unwavering focus on the issues of workforce management have gained us a reputation of being one of the most knowledgeable and accomplished strategic workforce partners in business for clients and candidates alike. Volt offers competitive compensation, a staff who are focused on the quality of your career and goals, and the solid security of a company trusted by Fortune 500 companies for over 60 years.\\r\\n\\r\\nCapitalizing on knowledge and innovation, comprehensive resources, and technology, Volt provides top talent to the many thousands of clients across the globe.  Volt provides highly skilled contingent workers to local, national and international clients in all major industries. Volt is a Six Sigma company and was recently listed as a Top 12 Six Sigma Company.  We have multiple opportunities in a variety of industries.  Check out what we have available by going to http://jobs.volt.com.\\r\\n\\r\\nVolt is an Equal Opportunity Employer.",
    "Score": 0.8520672321
  },
  "42": {
    "Title": "Technical Writer working in a Web environment",
    "Description": "\\r\\r    \\r    Create clear and thorough technical product publications including (but not limited to):\\r    \\r    Implementation/installation guides\\r    \\r    End user guides\\r    \\r    Release notes\\r    \\r    Assist with documentation of Feeds/API specifications\\r    \\r    Collaborate with existing documentation teams to ensure consistent standards/formats are followed for all deliverables\\r    \\r    Work with HTML and online documentation development tools (e.g. wikis, FAQs, Help sections, DocBook/XML).\\r    \\r    Help define and implement process improvements and best practices for managing documentation.\\r    \\r    Work independently with minimal direction by planning, scheduling, and coordinating work with other team members.\\r    \\r     \\r",
    "Score": 0.851251781
  },
  "43": {
    "Title": "Java Developer with Multi-threading",
    "Description": "Princeton Information is seeking a Java Developer with strong multi-threading experience for a contract-to-hire position in the Tampa Bay area.\\r\\n\\r\\nREQUIRED SKILLS \\r\\n \\r\\n• Java Development 1.4 and greater \\r\\n• Multi-threading \\r\\n• Oracle and/or SQL Server \\r\\n• Web services / XML \\r\\n• Strong UNIX scripting knowledge (Perl/Python) \\r\\n• Ability to produce good quality documented deliverables for consumption by others who may be less experienced \\r\\n \\r\\n PREFERRED SKILLS: \\r\\n \\r\\n• Experience working with large data sets/massive data sets \\r\\n• Experience working with data transformation (ETL on Oracle or UNIX or Oracle) \\r\\n• Red Hat Linux 5.x and greater \\r\\n• Windows Server 2000 and greater \\r\\n• Web Probing \\r\\n• Web Crawling \\r\\n• Content Scraping \\r\\n• Machine Learning Technologies \\r\\n• Content and data classification and organization \\r\\n• Languages: C / C++, C#, Java, Perl, Python. \\r\\n• VB6/Classic ASP (not .NET)/COM/DCOM knowledge \\r\\n• Experience working with on/off shore teams. \\r\\n \\r\\n Princeton Information is one of the nation's top five privately-held IT consulting firms, in business since 1985. Princeton Information services a clientele of primarily Fortune 500 companies nationwide.  With annual revenues over $120 million, Princeton Information operates across the US from multiple regional offices.Our Commitment to Our ConsultantsAs a privately held company, Princeton Information is solely committed to the success of clients and consultants - not to any shareholders. PI's success is grounded in the relationships we build with our consultants. We seek the best people; provide career path counseling; as well as the most challenging opportunities in business and in IT. As part of its culture of loyalty and commitment to its consultants, Princeton Information is committed to doing all we can to ensure our consultants have the best possible search, placement and work experience possible. Our ServicesWorking with one Princeton Recruiter will gain you access to over 500 open requirements with the top clients in the US across all industries (finance, insurance, pharmaceutical, commercial, telecom, media, manufacturing) nationwide.  Our local recruiters have in-depth knowledge of our clients and opportunities. They will work with you to find you the best possible opportunities for you and your career.Our RelationshipsOur relationships with our clients, as well as our consultants, are critical to our success!  We have a robust sales organization that ensures that Princeton has the inside track on what attributes a person needs in order to be successfully placed and engaged at our clients.  We know the technical and non-technical skills that our clients are looking for and we ensure that you are educated about the client prior to your interview with them.  Princeton is committed to going above and beyond to ensure that each meeting you have with a client is a successful one! ",
    "Score": 0.8510651588
  },
  "44": {
    "Title": "UI Developer",
    "Description": "This position requires an experienced, self motivated ASP.net developer with strong communication skills. Individuals applying for this position should have the ability to independently work through and solve complex issues. Candidates should also have a strong sense of UI and UX design considerations. Experience working in MVC3/4 beta using HTML5 and CSS3 is a must. Applicants should be comfortable working in a team environment and have good mentoring skills. \\r\\r\\r\\r\\r",
    "Score": 0.8478435278
  },
  "45": {
    "Title": "Front-end Web Developer",
    "Description": "Our client is a media company that provides consumers with tools and information they need to find a place to live through online, print and mobile platforms. They were recently acquired by TPG Capital which has allowed the company to grow, both in size and technology. The firm's investments in fast growing Internet companies and media franchises have included Sabre/Travelocity/Lastminute/ Hotwire and Creative Artists Agency. TPG Capital also has Internet retail and e-commerce expertise via multiple online platforms that have included NeimanMarcus.com, PETCO.com, JCrew.com and Become.com.",
    "Score": 0.8436654806
  },
  "46": {
    "Title": "Lead Java Developer",
    "Description": "Why make a move to FICO? At FICO, you can advance your career within one of the fastest-growing fields in technology today - analytics. With our industry leading credit scores and other solutions, FICO is the leader in predictive analytics for banking, insurance, retail and healthcare. Our ability to drive smarter decisions is driving some of the world’s leading companies to a new level of analytics-fuelled success. Our success is founded on really talented people – just like you – who enjoy: Innovation – change the game for us and for our clients around the worldTeamwork – lead and learn from the very best in your fieldHigh Performance – challenge yourself and reap the rewards of delivering resultsOpportunity – grow with a global company that develops talentResponsibilities include: Expected to translate Business Requirements into detailed technical design and implement solution Provide technical leadership where required to drive the design and software implementation activities.Core Competencies develop and maintain software systems go through a full software project lifecycle: Definition, Design, Implementation, Production and Support. Analyze and document customer requirements and produce detailed technical designs. Work with other developers in implementing solution. build mission critical and industrial strength (heavy data and volumes) using Java and Unix platform. collaborate with technical staff that can be geographically dispersed (within USA and India).",
    "Score": 0.8392347693
  },
  "47": {
    "Title": "Sr. C#/.NET Developer",
    "Description": "Desired Expertise:\\r1.) C#/ASP.NET 4.0 - REQUIRED, EXPERT\\r2.) Web Services (SOAP & REST) - REQUIRED, EXPERT\\r3.) XML & JSON - REQUIRED, EXPERT\\r4.) SVN Version Control - REQUIRED, EXPERT\\r5.) IIS/W2K8R2 - REQUIRED, Intermediate\\r6.) MS SQL Server 2008 - Preferred, Intermediate\\r7.) Social Network APIs (e.g., Facebook Graph API) - Preferred, Intermediate\\r8.) Mobile Communication (SMSC/MMSC) - Preferred, Intermediate\\r9.) Continuous Integration (CruiseControl) - Plus, Intermediate\\r \\rExpected Professional Qualities: \\r1.) Strong, proactive written and spoken communication skills. \\r2.) Enthusiastic collaboration and cooperation. \\r3.) Diligent self-direction.\\r \\rIdeal candidates will reside in the Phoenix metropolitan area, and have 3-5 years of experience with C#/.NET application development, with 2 years emphasis on design and architecture.  \\r\\r",
    "Score": 0.8391265273
  },
  "48": {
    "Title": "Software Developer - SQL Server",
    "Description": "\\rExcellent ability to perform project planning, perform independent preliminary analysis of management requirements and develop effective solutions that satisfy management and I.T. requirements. Candidate must have extensive experience in system documentation and program documentation. Must be a self-motivated team player with excellent communication skills and have a strong individual accountability for one’s own work.\\r \\rDeveloper must also present:\\r• Excellent Presentation Skills\\r• Strong Communication and Interpersonal Skills\\r• Support, maintain, and document software functionality\\r• Integrate software with existing systems\\r• Excellent Technical Knowledge\\r• Designing, coding and debugging applications in various software languages\\r• Full life-cycle application Development\\r• Software Analysis, requirements analysis, code review, and software reliability analysis\\r• Extensive experience in the research, analysis, design, development, test, demonstration, implementation and coordination of applications in various environments:\\r\\rJob Responsibilities\\r\\r•Responsible for development of stored procedures, triggers and ETL scripts.\\r•Proactively monitor the Production Database and optimize stored procedures for better performance.\\r•Resolve locking conflicts and resource utilization.\\r•Ensure all database environments (Development, Staging, QA and Production) are in sync.\\r•Define db scripts versioning system to keep track of database versions for all environments.\\r•Manage and Create database schemas for Relational Database Systems (optimize index creation, table creation, storage allocations, etc.\\r• 3-5 Years SQL Server DBA Experience required which includes:\\r•Experience with large databases with high transaction volume in a fast-paced, production environment.\\r•Experience with SQL Server Logshipping, Replication and Clustering.\\r•Experience with physical database design for SQL Server 2008.\\r\\r ",
    "Score": 0.8326207995
  },
  "49": {
    "Title": "QA Analyst with Java Development b/c",
    "Description": "\\r\\r\\r\\r\\r\\rPosition Title:  QA Analyst with Java Development b/c\\rJob Type: Contract\\rTax Terms: C2C\\rJob Duration: 6-12 Months+\\rLocation: Chicago, IL\\r \\r\\rResponsibilities:  \\r\\r\\r\\r    Looking  for QA Analyst with Java development b/c…….MUST OR\\r    Java Developer interested in QA Analyst profile\\r    SQL….MUST\\r    UNIX/Linux\\r    Shell scripting\\r    Informatica…..a plus\\r\\r\\r",
    "Score": 0.8301489949
  },
  "50": {
    "Title": "IT Project Manager (Level III)",
    "Description": null,
    "Score": 0.8262761235
  },
  "51": {
    "Title": "Sr. Software Engineer II",
    "Description": "At Terumo Cardiovascular Systems, we develop, manufacture and distribute medical devices for cardiac and vascular surgery with an emphasis on cardiopulmonary bypass, intra–operative monitoring and vascular grafting. Each year, millions of patients around the world benefit from the use of Terumo Cardiovascular Systems products. Our corporate headquarters is located in Ann Arbor, Michigan along with one of our manufacturing sites. We employ over 650 Associates in our Ann Arbor location. We also have two other manufacturing sites - one in Ashland, MA and the other one in Elkton, MD. Our parent company, Terumo Corporation, is a global medical device manufacturer focused on cardiac and vascular specialties, hospital products and home health care. Terumo has more than 11,000 associates in 82 sales offices and 17 production facilities around the world. Terumo Cardiovascular Systems Cardiac surgery products include a full–line of perfusion products, a full line of cannulae, and endoscopic vein harvesting products. This position is a technical leadership position responsible for leading software and systems design, implementation and tests for new electromechanical devices, and for enhancements and support of existing safety-critical electromechanical devices. Will be involved with several different areas such as real-time embedded systems software development and software lifecycle. This position requires a high level of cross-functional communication and the ability to lead specific projects technical initiatives. ",
    "Score": 0.8260119557
  },
  "52": {
    "Title": "UI Senior Software Engineer",
    "Description": "\\rUI Senior Software Engineer Overview (Travel Airline 3 Solution):\\rThe candidate should be a seasoned web application developer experienced in writing JSP applications and Spring MVC while being proficient in the use of jQuery and JavaScript for providing dynamic content and HTML/CSS. \\rProficiency required in the following toolkits, frameworks, standards & languages: \\r\\r    JavaScript\\r    CSS\\r    HTML\\r    JSON\\r    jQuery\\r    JSP Proficiency preferred in the following toolkits, frameworks & standards\\r    \\r        Spring MVC \\r        Spring WebFlow\\r        Modernizr\\r        Knockout\\r        Tiles\\r        WebShims\\r        YepNope\\r        REST\\r        SOAP Tooling\\r        SpringSource Tool Suite / Eclipse\\r        Maven\\r        Subversion (SVN)\\r        Continuous Integration (CI) systems \\r    \\r    \\r\\r",
    "Score": 0.8220580816
  },
  "53": {
    "Title": "Oracle Application Server Developer",
    "Description": "Area Overview: The Technology Services Group supports various automation efforts, both new development and maintenance of existing applications in support of many different business lines across Client system. Top 5-10 technical skills required for the job:   Oracle Developer Suite (Oracle Forms Builder and Oracle Reports Builder) and integration with Oracle Application Server   WebUtil package   Oracle PL/SQL, Oracle SQL*Loader, Oracle Database, SQL*Plus, TOAD for Oracle 10g & 11g, Oracle SQL Developer, ODBC   Java and Web technologies - HTML, XML, JSP, JavaScript and Oracle 11g Application Development Framework   JUNIT, Maven, Subversion Job Description: The position is for an advanced Oracle Application Developer who has very strong experience in the Oracle developer suite of environments for both v10g and v11g. As a member of the Application Development staff, the candidate will lead the full life cycle upgrade efforts (e.g. analysis, design, coding, debugging, testing, tuning, building, deploying, training, and documentation) from Oracle App Server v10g to Oracle Fusion Middleware v11g. The candidate will be responsible for the following:   Assess the impact/changes to the applications due to upgrade of Oracle 10g AS to Oracle FMW 11g;   Recommend the best approach to upgrade the current Oracle Forms/Oracle Reports to 11g   Perform migration and testing of the current Oracle Forms/Oracle Reports for the applications (Treasury Benchmark Claims and Liabilities);   Deploy the applications in Oracle FMW 11g environments;   Provide support during the user acceptance test;   Provide training to other team members;   Provide documentation. \\r\\n Required Skills:Top 5-10 technical skills required for the job:   Oracle Developer Suite (Oracle Forms Builder and Oracle Reports Builder) and integration with Oracle Application Server   WebUtil package   Oracle PL/SQL, Oracle SQL*Loader, Oracle Database, SQL*Plus, TOAD for Oracle 10g & 11g, Oracle SQL Developer, ODBC   Java and Web technologies - HTML, XML, JSP, JavaScript and Oracle 11g Application Development Framework   JUNIT, Maven, Subversion   At least five years of working experience with Oracle Forms Builder (10g & 11g), Oracle Reports Builder (10g & 11g), integration with Oracle AS 10g and Oracle Fusion Middleware 11g and WebUtil package;   At least five years of working experience with Oracle PL/SQL (10g & 11g), Oracle SQL*Loader (10g & 11g), Oracle Database (10g & 11g), SQL*Plus, TOAD for Oracle 10g & 11g, Oracle SQL Developer, ODBC on Windows and Sun Solaris environments;   At least three years of working experience to upgrade Oracle applications using Oracle Forms Builder and Oracle Reports Builder from 10g to 11g in Windows (2003 and 2008 platforms);   At least three years of working experience with Java and Web technologies - HTML, XML, JSP, JavaScript and Oracle 11g Application Development Framework;   Experience working with JUNIT, Maven, Subversion;   Experience working with Windows XP and Windows 7 (32-bit and 64-bit) client environments;   Strong analysis and design skills including Oracle Forms and Oracle Reports using Object Library and Templates;   Strong problem solving and analytical skills demonstrated by the ability to assimilate new information, understand complex topics and arrive at sound analysis and judgment. \\r\\n Critical Skills:  Advanced Oracle Forms, Oracle Reports, WebUtil package, Oracle Application Server Integration with Oracle Forms/Oracle Reports, Oracle PL/SQL, Oracle SQL*Loader, SQL*Plus, TOAD for Oracle, Oracle SQL Developer, JDeveloper, JAVA and Web technologies (HTML, XML, JSP, JavaScript). \\r\\n Preferred Skills:  Strong verbal, written, and presentation skills. \\r\\n Education/Certifications:Bachelor's or Master's Degree in a relevant field of work or equivalent work experience. \\r\\n Princeton Information is one of the nation's top five privately-held IT consulting firms, in business since 1985. Princeton Information services a clientele of primarily Fortune 500 companies nationwide.  With annual revenues over $120 million, Princeton Information operates across the US from multiple regional offices.Our Commitment to Our ConsultantsAs a privately held company, Princeton Information is solely committed to the success of clients and consultants - not to any shareholders. PI's success is grounded in the relationships we build with our consultants. We seek the best people; provide career path counseling; as well as the most challenging opportunities in business and in IT. As part of its culture of loyalty and commitment to its consultants, Princeton Information is committed to doing all we can to ensure our consultants have the best possible search, placement and work experience possible. Our ServicesWorking with one Princeton Recruiter will gain you access to over 500 open requirements with the top clients in the US across all industries (finance, insurance, pharmaceutical, commercial, telecom, media, manufacturing) nationwide.  Our local recruiters have in-depth knowledge of our clients and opportunities. They will work with you to find you the best possible opportunities for you and your career.Our RelationshipsOur relationships with our clients, as well as our consultants, are critical to our success!  We have a robust sales organization that ensures that Princeton has the inside track on what attributes a person needs in order to be successfully placed and engaged at our clients.  We know the technical and non-technical skills that our clients are looking for and we ensure that you are educated about the client prior to your interview with them.  Princeton is committed to going above and beyond to ensure that each meeting you have with a client is a successful one! ",
    "Score": 0.8180882931
  },
  "54": {
    "Title": "Senior QA Software DATA Tester",
    "Description": "Essential Responsibilities\\rOur client is passionate about using science and technology to improve agriculture. Our client’s scientists are conducting the research and development (R&D) to revolutionize plant breeding and biotechnology. This group supports our client’s scientists to develop software platforms that enable these research and development efforts. This opportunity would allow the accepted candidate to directly contribute to delivering state-of-the art IT solutions.  The successful candidate will be a member of our client’s test enterprise-level Java, .Net, and Oracle applications. Candidates with a background in science are highly desired for this position.\\r\\rEach team is comprised of a project manager, business analysts, software developers and testers.  These teams design, develop, and test our client’s enterprise-class R&D software. The individual will be responsible for performing integration and system testing for each iteration of the development life cycle. The individual will need to implement test scripts based on requirements created by the Business Analyst. The tester is responsible for logging the defects identified during testing. ",
    "Score": 0.8129529357
  },
  "55": {
    "Title": "Technology Sales Specialist - El Segundo, CA (5408)",
    "Description": "\\rFor 35 years, mid-sized and large firms have trusted MarketSource’s sales and marketing outsourced services to accelerate their revenue growth and control costs. MarketSource designs and deploys field sales and marketing teams in just weeks while simultaneously generating sales.\\r\\r\\rTechnology Sales Specialist\\r\\r MarketSource is currently looking for exceptional individuals to fill a permanent part-time position in assisted sales. This Technology Sales Specialist position requires a solid understanding of consumer electronics and the ability to sell technology with extraordinary customer satisfaction. The ideal candidate will be responsible for proactively approaching customers in a retail environment and assisting with product sales.\\r\\rThese part time positions require 100% personality, dependability, professionalism, and a desire to have fun! The general hours are on the weekends with some flexible weekday hours.  There will be additional shifts you can pick up intermittently for extra hours.  This role incorporates a mixture of sales, training and brand advocacy and is an exciting opportunity for someone who enjoys technology and in person customer interaction.\\r\\rThese are permanent part time positions – We are looking for candidates who are searching for a long term part time opportunity.\\r\\rKey Responsibilities:\\r\\r    Driving product sales at assigned events through customer interaction\\r    Educate customers and associates on why the product is the best choice for customers\\r    Product demonstration, merchandising, marketing, and advertising\\r    Professionally representing MarketSource and its clients at all times\\r    Maintaining a sound knowledge of client's consumer electronic products\\r    Increase visibility and value in client’s products and services\\r    Must meet paid e-learning requirements\\r",
    "Score": 0.80916816
  },
  "56": {
    "Title": "C++ Software Developer",
    "Description": "Are you looking for a new and exciting opportunity to use your technical skills in a successful and growing company?  Do you have experience with C++, are you proficient in mathematics and geometric reasoning, and are you looking for an opportunity to work as a developer with a strong development team?   If so, don’t miss applying for this position at Proto Labs!\\r \\rProto Labs is the world's fastest manufacturer of custom prototype and low-volume parts.  We've revolutionized our industry by developing proprietary computing technologies and automated manufacturing processes that enable us to create real parts, really fast.  Our fast-paced, casual work environment is driven by employees who thrive on innovative thinking, making Proto Labs not only a great place to work, but also one of the fastest growing companies in the region.\\r \\rSoftware teams at Proto Labs are self-directed and focused on solving technical problems. We place a premium on “coolness\" in what we craft.   We use multi-node compute clusters to turbo-charge our applications, and are always looking for more “wow\" in our capabilities.  We are currently looking for a software engineer to join our computer-aided manufacturing (CAM) application group.\\r \\rAs a member of the CAM team, you will work alongside other highly qualified engineers building, maintaining, and enhancing our software.  Specific duties may include:\\r \\r\\r    Design, code, debug, and test software that has a high degree of complexity\\r    Participate in problem analysis and solution development with team members\\r    Provide support and develop fixes for mission critical applications \\r",
    "Score": 0.8060690165
  },
  "57": {
    "Title": "Software Enginner with Java and Video streaming experience",
    "Description": "\\rOpen Roads Consulting is an industry leader in systems integration and technology development for sensing, control, surveillance, and communication systems. We are a preferred provider and partner for U.S. Military, Federal, State, and Local Government agencies across the United States and its territories. We specialize in systems for the transportation and physical security markets.\\r\\r\\rCurrently, we are seeking a Software Engineer with 5 to 10 years of Java software development experience, who holds a BS in Computer Science, Engineering, or related discipline. We are specifically looking for someone with specialized experience in the area of video streaming.  Employment would be at our corporate office in Chesapeake, Virginia or at our office in Austin, Texas.\\r\\rKey Responsibilities: \\rThis individual will play an integral role in the development of innovative real-time applications for our Transportation and Security divisions. This will include requirement analysis, design, implementation, testing and installation of real-time systems. Explore cutting edge video content analysis and advanced video streaming, and MPEG decoders for video content delivery.  This individual will develop and integrate software in full-life cycle projects for both custom projects, and core products. This will be a challenging and rewarding position, where you will be exposed to a wide variety of projects, and will be rewarded with great opportunity for advancement. \\r                                                                       \\rThe ideal candidate should have:\\r\\r    5 to 10 years of experience in application development utilizing Java\\r    3 to 5 years experience with video streaming, including:\\r    \\r        Video standards such as H.264 and MPEG-4 and video transmission standards such as Unicast and Multicast\\r        Direct Show\\r        Real Time Streaming Protocol (RTSP)\\r        Real Time Messaging Protocol (RTMP)\\r        Video Transcoding \\r    \\r    Strong written and verbal communication skills\\r    Must have a high level of professionalism, integrity, and a strong commitment to quality, ability to multi-task, and meet project deadlines\\r    Ability to gather effective functional requirements and write detailed design documentation\\r    Develop and implement solutions\\r    Sound analytical problem solving abilities\\r    Ability to troubleshoot complex problems\\r    Work effectively with multiple teams on various design, development, and production issues\\r    Experience with Intelligent Transportation Systems (ITS) is a plus \\r\\r Desired Qualifications Include:\\r\\r    Experience with Camera Control protocols\\r    Experience with Network Video Recording solutions\\r    Experience with Google Web Toolkit (GWT)\\r    Experience with displaying video in web applications \\r\\rOpen Roads offers competitive salaries and benefit package that include:  health, vision and dental insurance; company paid life, short-term disability, and long-term disability; flexible benefit spending plan and retirement benefits.\\r\\r\\r\\rSend Resume to hr@openroadsconsulting.com\\r\\rEOE/AA/M/F/V/D Drug Free Workplace\\r\\r",
    "Score": 0.8059261441
  },
  "58": {
    "Title": "Network Security - Windows / UNIX / CISSP",
    "Description": "Our client, a large, established market leader with a significant retail and wholesale presence is looking for a Security Engineer to join its Infrastructure team.  This position is a high visibility role as you will be helping shape the network and make presentations to senior management.",
    "Score": 0.8040216565
  },
  "59": {
    "Title": "SharePoint/.NET Developer - Rock Solid Company!",
    "Description": "SharePoint/.NET Developer\\r\\rA great company is in need of a SharePoint/.NET Developer! You will be responsible for building new subsite templates, configurations and customizations for existing templates and additional functionality and .NET enhancements in the Sharepoint subsites and backend. You will also be responsible for ensuring that software solutions are implemented in an efficient manner and ensure the satisfaction of the users by providing exceptional application technical support by researching issues and by problem solving. You will immediately start working with making enhancements to the company's website in SharePoint and reviewing vendor code that is written in .NET and integrated with SharePoint. Support technical design activities related to application software, data, databases, packaged solutions and infrastructure components. This is a contract to perm position. \\r\\rBenefits: \\r\\r    Health Insurance \\r    401(K) \\r    Tuition reimbursement \\r    Holiday Pay \\r    Vacation Pay \\r\\r\\rPlease email us your daytime phone number so that we can get started on this right away. It is our job to be very discreet. No fee for applicants. \\r\\rwww.digitalstaffing.com",
    "Score": 0.7995293736
  },
  "60": {
    "Title": "SQL Server Database Developer",
    "Description": "duPont REGISTRY™ is seeking a SQL Server Database Developer to join a growing team of superstars in the Web Development Group.\\r\\rWe provide the latest hardware, software, and learning opportunities to raise your ability to the next level.\\r\\rWe are looking for a motivated individual with Microsoft SQL Server and C# experience and a burning desire to learn, grow and achieve.\\r\\rWorking in the Web Development Group, the SQL Server Database Developer will service the critical information needs across the organization as they relate to data processing.\\r\\rIn this highly visible position, you will receive exposure to the critical processes that affect the whole organization.\\r\\rIn order to succeed, you will need to be comfortable juggling several projects at once and handling the occasional quick turnaround request.\\r\\rYou will assist in ETL processing as well as building and tuning queries and stored procedures.\\r\\rSpecifically, you will be central in helping to develop world class Data Services and to improve data quality and ETL process streamlining.\\r\\rYou will be reporting to the Senior Data Administrator. As such, you will be given guidance to follow an overall strategy and framework for the evolution of our data processing systems.\\r\\rWe have an excellent working environment and we are looking for a talented, keen individual who knows they have the skills and ability to jump in and get the job done.\\r\\rLOCAL CANDIDATES ONLY\\r\\rRole / Responsibilities:\\r\\r•Create complex queries on data sets\\r•Create stored procedures, triggers, and functions\\r•Maintain a Data Dictionary -- metadata repository\\r•Generate code to extract, transform and load data from production data sources to the data warehouse using custom C# processes and SSIS\\r•Performance tuning of key queries\\r•ETL with delimited text files\\r•Execute daily work orders to setup data feed processes\\r•Monitor feed processing systems\\r•Develop web based tools to improve monitoring of feeds in C# asp.net - Intranet\\r•Reports development using SSRS - Intranet\\r\\r",
    "Score": 0.79140836
  },
  "61": {
    "Title": "$Up to $80K ~ Inside Sales ~ Room for Growth!",
    "Description": "Top International Distributor of Electronic Components is looking to grow their Inside Sales Team.  Looking for a candidate with a drive to grow business and cultivate new and long-lasting client relationships.  Heavy phone work.  Small base plus heavy commission.  Earning potential of $60-$80K your first year.  Great benefits!\\r\\n\\r\\nPlease attach resume for review.  Interviews available immediately!  We are an equal employment opportunity employer.",
    "Score": 0.7902998924
  },
  "62": {
    "Title": "C# .NET Developer with Silverlight, WPF, WCF in West Houston",
    "Description": "Classification:   Programmer/Analyst\\r\\n \\r\\nCompensation:   $65,000.00 to $100,000.00 per year\\r\\n \\r\\nRobert Half Technology is currently looking for a C# .NET Developer for a position in West Houston.\\r\\n\\r\\nESSENTIAL DUTIES AND RESPONSIBILITIES:\\r\\n• Design, implement, and test software applications.\\r\\n• Provide input for future software development considerations.\\r\\n• Work with QA Team in analyzing and correcting our applications.\\r\\n• Update existing applications according to newer requirements.\\r\\n• Ability to work well closely with and communicate well with a team.\\r\\n• Attention to detail, goal driven personality, and the ability to think    outside the box to solve problems.\\r\\n• Become an integral part of a development team environment.",
    "Score": 0.7899667025
  },
  "63": {
    "Title": "Director, Software Development",
    "Description": "Excellent opportunity to relocate to one of the most beautiful areas in the South East.  With an affordable cost of living and wonderful private schools, Louisiana is a good financial move for any family.\\r\\rChance to join a European based company which provides financial software solutions to small and medium sized banks in North and South America.  The Director of Sofware Development will lead two development teams .  Once team is located in Atlanta, the other in Louisiana.  Great opportunity for someone with 5+ years leading development teams, particulary over .Net and Java development teams focused on middle-tier and backend/desktop software development.  Must have experience leading cross functional teams.  Drives the project management methodology and infrastructure for development projects, manages a methodology driven quality plan, monitors and controls the quality of the deliverable, as well as manages the project completion process through customer acceptance. Works with business unit managers and forms alliances on projects, operational decisions, scheduling requirements/conflicts and vendor contract clarification. Will be required to work with and matrix resources with development directors supporting other business unit locations as well as off-shore resources.\\r\\rA preference will be shown for candidates who have led large teams of 50+ developers with several Project Managers and Technical Directors reporting to them.\\r\\rCompany will cover relocation and interview expenses.  Salary is extremly competitive with excellent benefits (over 20 days paid time off per year).\\r",
    "Score": 0.7890985608
  },
  "64": {
    "Title": "Sr. Design Engineer (API Gate Valves))",
    "Description": "My client, a progressive, growth oriented oilfield equipment company is in need of a senior design engineer. Specific experience in the design of API 6A Gate valves is required. Job responsibilities include not only product design but working w/ customers re their specific needs / problems and providing solutions.  Solid Works or similar experience is needed ..... Looking for a minimum of 10 years related experience or above and a BS in Mechanical Engineering.  Company has recently changed ownership and plans for further  growth both domestically and internationally.  This is a very enterpreneurial company where new ideas are fully considered. We are looking for a creative professional and problem solver who wants a medium sized company environment. Job location is Houston headquarter offices. Excellent career opportunity.",
    "Score": 0.788785398
  },
  "65": {
    "Title": "Senior Software Engineer (Cloud and Web Platform Engineering)",
    "Description": "\\rSenior Software Engineer (Cloud and Web Platform Engineering)\\rCyDesign Labs   Palo Alto, CA \\r\\r\\rTHE STORY:\\rCyDesign Labs is a fast growing and profitable start up in Palo Alto. We have an opportunity for a grand engineering challenge of building the next generation cloud computing platforms and tools for model based design optimization to effectively enhance the Product Lifecycle Management (PLM) for the automotive, aerospace, aviation, defense and medical equipment industries. We are expecting to grow the company over 400% this year! \\r\\rYOUR JOURNEY:\\rWe currently have multiple openings for collaborative software engineers (up to principal level) in our Platform Engineering team located in Palo Alto, CA. The senior software engineer will work closely with the Director of Platform Engineering to develop, discuss architecture and implement a highly scalable, cloud based solutions in support of the CyDesign services.\\r\\rThe platform team will leverage existing open source software and products of our research partners so the ability to be able to learn and “own\" large existing code bases and understanding how to integrate with them is a vital skill for this position. Because the services provided by the platform group will be used by both internal and external clients, communication and outreach will also be an important part of the software engineering role.\\r\\r\\r\\r",
    "Score": 0.7887266278
  },
  "66": {
    "Title": "Web Application Developer - .NET",
    "Description": "MMY is growing and looking for great people to grow with us!\\r\\rWe're working to  build a community of technology enthusiasts who regularly share best practices and ideas and want you to join in!\\r\\rWe have immediate needs for experienced .NET Developers.\\rAs a .NET Developer you will be responsible for identifying, designing, implementing, and delivering quality software applications to our clients.\\r\\rYou will be:\\r\\r\\r\\r    Designing, developing and supporting applications for the rebuild of applications using C#.NET and ASP.NET AJAX\\r    Test and debug system conversion to new SQL methodology\\r    Develop SQL conversion using T-SQL\\r    Assist in designing and implementing database\\r\\r\\r\\r ",
    "Score": 0.7860443592
  },
  "67": {
    "Title": "C++/MFC Software Developer",
    "Description": "C++ Software Developer\\r\\rThe successful candidate possesses solid C++ and MFC skills in a Microsoft development environment and will be integrated into an Agile development team.  .\\rRequirements:\\rDegree in Computer Science, Applied Mathematics, Engineering or related\\rFive to seven years of experience in a commercial software development environment\\rProficiency in C++\\rExperience with MS Windows development environment (i.e. Visual Studio)\\rProficiency with MFC\\rStrong object orientation (design and programming)\\rSolid knowledge of code refactoring\\rTrack record of completing tasks on schedule\\rCapable of working well in a team oriented environment\\rSolid written and verbal communication skills\\rStrong problem solving skills: able to identify problems and to analyze and apply best solutions\\rExperience in building complex scientific software applications\\rPreferred:\\rAgile software development methodology\\rFamiliarity with geophysics and/or geology in particular, and oil and gas exploration in general",
    "Score": 0.7859724164
  },
  "68": {
    "Title": "Entry-level Software Developer",
    "Description": "DIS Corporation, the leading supplier of Business Systems for the heavy equipment dealership market, is looking to fill an entry level developer position for our Mobile Technologies Team.  This individual must be self- motivated, and dedicated to quality.\\r",
    "Score": 0.7859724164
  },
  "69": {
    "Title": "Java Warrior (Software Engineer)",
    "Description": "Are you stuck in a position that has you maintaining code?  Have you ever been handed a specification to build without the understanding of the bigger picture and the knowledge of how your product will be used?  Do you want to be a key developer helping financial institutions worldwide?  Do you wish you were creating new products?  We are expanding our product base and are looking for the right champions to help us create solutions. At SHAZAM you will experience all this and more!  \\r \\rSHAZAM is a dynamic and fast paced organization that supports community financial institutions in 30 states.  We are a stable company which has not been merged or acquired since our inception over 30 years ago.  Our vision is to develop people.  We have a staff of dedicated and friendly IT professionals and emphasize the team dynamic.  As a member of the Web Development Team, you will have the opportunity to participate not only in JAVA/J2EE code development, but as a part of a team responsible for recommending development frameworks and/or technologies used in the overall solution.  In addition, SHAZAM offers two facilities with state of the art technology.  Our Johnston office is located in a greenbelt area.  \\r\\r\\rWithin three months you will independently contribute to exciting enterprise web projects that deal directly with the financial institutions in the banking industry.  You will share your JAVA/J2EE experience with others on the web development team using cutting edge technology.  You will be challenged to come up to speed at SHAZAM by resolving production issues that affect a financial institution’s ability to assist their customers and manage their business. Consider being a part of a small company with double digit growth and big company benefits!  Don’t miss this opportunity!  \\r\\rThis position will be in Johnston, IA.  We do provide relocation.\\r\\rWe offer highly competitive salary, complete benefit package including educational assistance, fitness reimbursement, 401(k), medical/dental plan, a company funded pension plan and much more. To apply, or to request accommodation to apply, send a cover letter, resume, salary history, to:\\rITS, Inc.\\rHuman Resources Dept\\r6700 Pioneer Parkway\\rJohnston, IA 50131\\rFax: (515) 558-7609\\rwww.shazam.net\\rEOE/MF\\r \\rApplicants cannot apply in person \\rWe do not accept resumes/applications brought to our office\\r \\r \\r \\r ",
    "Score": 0.7837460637
  },
  "70": {
    "Title": "Client Server Software Analyst I or Above",
    "Description": " SummaryLearns and applies the concepts of database applications and programming languages in order to successfully complete projects for TSYS internal and external clients.  Reviews, maintains, and updates applications to insure accuracy, completeness, adherence to approved TSYS guidelines.  Modifies and integrates applications with current applications and databases to optimize performance.   ResponsibilitiesUnder much guidance and supervision, develops and builds applications and/or databases for internal or external clients in a fast-paced or project oriented environment.  Attends numerous training classes to gain a broad understanding of current database applications and programming languages.  Apply learning skills in database applications and programming languages to TSYS projects as assigned.  Receives business requirements from client via a Business Analyst and successfully builds applications, functions, and processes using programming skills/software.  Creates databases via a server and front-end applications (interface) using web development tools.  Conducts testing, including unit, business analysis, and client testing, (via a pilot site) for accuracy.  Maintains tested applications for quality assurance and production support.   Develops a general understanding of TSYS, software platforms, and the credit card industry through extensive training.  Develops a general understanding of the company’s project development/management processes, methodology, and the impact of the project management metrics and reporting on TSYS.  Operates and maintains existing production database applications.  Generates ad-hoc and standard reports using existing reporting applications.  Assists in disaster recovery projects and events.  Enhance existing applications to meet the needs of ongoing efforts within software platforms.  Participates in team, department, and division meetings as required.  ",
    "Score": 0.7833191156
  },
  "71": {
    "Title": "JR Oracle Apps Database Administrator",
    "Description": "We are currently seeking a Junior Oracle Apps Database Administrator to join our growing MIS department!   \\r\\r\\rThe Junior Oracle Apps Database Administrator will be a service oriented individual responsible for the administration, support and maintenance of multiple Oracle and Application Server databases. This position will report to the DBA team lead.\\r\\rResponsibilities include, but are not limited to:\\r\\r    Install, configure and administer database management utilities, and tools\\r    Develop and maintain standards, procedures and methodologies for effective operation, access, control backup and recovery of all database systems\\r    Enforce, manage and create policies and procedures\\r    Provide all support related issues for production, QA, and development database (24x7)\\r    Work closely with business and MIS associates and outside vendors to effectively plan, deploy and update database environment additions and changes\\r    Application Patching on Oracle eBusiness Suite Instances\\r    Troubleshoot any ORA- errors and Application Errors\\r    Facilitate application development, QA/Business Analysts problem resolution with optimum speed and efficiency\\r    Database and Application Cloning\\r    Adequate knowledge of tools such as TOAD/SQL Navigator/OEM\\r    Maintain database backup/recovery environment using RMAN. \\r    Additional responsibilities as assigned by management \\r",
    "Score": 0.781701088
  },
  "72": {
    "Title": "Junior Java Developer",
    "Description": null,
    "Score": 0.7780280113
  },
  "73": {
    "Title": "PHP Developer",
    "Description": "Do you eat, sleep, and dream code? Is Big Bang Theory your favorite show? Then this cutting edge digital agency wants you. We are looking for a talented PHP developer to join our development team to work on custom, enterprise-level web applications. You must be organized and skilled in Object Oriented PHP, MySQL and Jquery. The position will require working with a development team and will be integral in projects from concept to finish. We offer a comfortable work environment with lots of natural light, endless supply of coffee, staff controlled music system and wonderful, quirky coworkers.\\r\\rAbout Tambourine\\r\\rTambourine, a rapidly expanding hospitality & travel marketing agency, is looking for a PHP Developer to join our South Florida team. . . a smart group of digital marketing experts who work in a fun and comfortable boutique business environment. The Company is hyper-focused on client ROI and results while maintaining work/life balance for all employees. Our services include website design/development, socialmedia, SEO, SEM, email marketing, mobile marketing, online advertising and data analytics.",
    "Score": 0.7766119242
  },
  "74": {
    "Title": "Java Sotware Developer",
    "Description": "Are you looking for an exciting opportunity with one of the region's fastest growing organizations?  If so, then this is the opportunity for you!!!!\\r\\rSUMMARY: \\rOpportunity for a mid-level Java developer who can work in a small team developing a network security appliance. The ideal candidate must be able to “dig in\" and bring understanding and structure to poorly defined problems, propose solutions, and bring the best solution to closure.\\r  \\rDESCRIPTION: \\r\\r    Define, design and implement complex software in time-critical distributed applications. \\r    Estimate effort, plan implementation and track changes. \\r\\r\\r    Participating in a multi-discipline engineering team that supports the life-cycle activities of software products and systems. \\r    Perform additional duties as required.\\r",
    "Score": 0.774633646
  },
  "75": {
    "Title": "Java PL/SQL Developer",
    "Description": "\\r\\nAs a member of the business application team, you will work with  business users to get business requirements, analyze the requirements, come up with high-level design, solution proposal, get sign-off on the solution from business, do detail design, code, build the solution, build and execute unit tests and unit plans, deploy the solution to production for highly complex enhancements and bugs. \\r\\nBS/MS in Computer Science or equivalent \\r\\n6+ years experience in developing and maintaining business applications \\r\\nSQL/PLSQL, Java (J2EE), ADF programming experience is a must\\r\\nOracle RDBMS and Oracle Application Server, Fusion Middle-ware experience is a must\\r\\nHighly proficient in Perl or Shell scripting.\\r\\nWorking experience in financing or leasing applications is a plus\\r\\nWorking experience in Oracle Applications or Oracle Siebel applications is a plus\\r\\nWorking experience in other Oracle Technologies (Oracle Application Express, EM etc) experience is a plus.\\r\\nKnowledge of Java Scripting \\r\\nKnowledge of Software Development Life Cycle (SDLC) processes\\r\\nKnowledge of Source Control Systems (CVS)\\r\\nKnowledge of QA tools (Web tester, Selenium)\\r\\nExcellent analytical and communication skills \\r\\nSelf motivated with strong ability to learn quickly and work independently\\r\\nRandstad Technologies is an EOE-M/F/V/D and is a wholly owned subsidiary of Randstad Holding nv, a $22.5 billion global provider of HR services and the second largest staffing organization in the world.",
    "Score": 0.774633646
  },
  "76": {
    "Title": "java Software Engineer ( full time )",
    "Description": "\\r Direct client Requirement\\r\\r\\r\\rJava Developers ( full time position)\\r \\r \\r \\rLocation: Richfield, OH\\r \\rDuration: Full time or cont to hire\\r \\rVisa Status: US citizen or GC holder who doe not need any visa status.\\r \\r \\r \\rOPEN #2 – SOFTWARE ENGINEER \\r \\r \\r \\rPerforms moderately complex application design, systems analysis, and programming activities, which may require extensive research. Reports to an Application Engineering Manager; may be an individual contributor recognized for specific technical expertise or act as project leader addressing a wide range of technical issues within a project(s).\\r \\r \\r \\rDuties and Responsibilities\\r \\r \\r \\rPerforms moderately complex product design and implementation activities which may require extensive research and analysis; performs design, implementation and maintenance of moderately complex multiple product modules/sub-systems; Performs moderately complex bug verification, release testing and support for assigned products; researches problems discovered and develops solutions to the problems; conducts unit testing and integration testing for functionality and limits.\\r \\rResearches and understands the marketing requirements for a product, including target environment, performance criteria and competitive issues; suggests technical approaches to management on projects.\\r \\rAs a project leader effectively handles all development activities of the project, (i.e., identifies resource requirements; manages multiple concurrent related activities, suspends and resumes activities as priorities shift, quantifies risk when contingency planning is needed)\\r \\rProvides technical leadership to the team by researching new technology or development tools; is current on activities within the department, company and industry \\r \\rHas greater interaction with clients; actively participates in presentations, technical demonstrations, etc.  \\r \\rProvides training/instruction and technical mentoring to junior associates \\r \\r \\r \\rJob Qualifications:\\r \\r \\r \\rBachelor’s Degree in Computer Science; Minimum 6 years experience in software engineering field\\r \\rMinimum 4 years of development experience in Java, with specific focus on the Java middletier development\\r \\rThorough understanding of accepted application design principles and multi-tier development practices.\\r \\rDemonstrate strong knowledge in design patterns, distributed computing concepts, formal functional representation and able to convey concepts into detailed system specifications defining software architectures\\r \\rThorough technical knowledge of industry standards with an emphasis on Web Services\\r \\rBasic understanding of Service Oriented Architecture; Practical experience desirable.\\r \\rThorough technical knowledge of software development methodologies.\\r \\rDemonstrate strong analytical skills in evaluating complex requirements, and in implementing a reusable “Database + Java\" combined solution\\r \\rExcellent skills in research and analysis, project planning and implementation\\r \\rStrong understanding of entire development process, including specification, documentation and quality assurance\\r \\rBasic awareness of business issues as they impact overall project plans\\r \\rRecognized central point for technical issues across groups and products\\r \\rProven communication, presentation and interpersonal skills\\r \\rAbility to work effectively as a team leader, team member or individual contributor\\r \\rDemonstrated project leadership ability\\r \\rDemonstrate specific hands-on experience in developing data access layer in java involving complex SQL and stored procedures\\r \\rExperience in advanced database design techniques, including query tuning and optimizations\\r \\rKnowledge of writing stored procedures and functions in SQL Server 2005 / 2008 and Oracle 11G\\r \\rExperience in meta-data and rules driven database design is a plus.\\r \\rKnowledge of Oracle and PostgreSQL is a plus\\r \\rKnowledge of Lucene search engine is a plus \\r\\r \\r \\r",
    "Score": 0.7738221288
  },
  "77": {
    "Title": "HSE Coordinator - Wind Energy - Houston, TX",
    "Description": "The Upstream Americas portfolio today generates significant cash flow from core producing areas. We explore for and extract crude oil and natural gas, often in joint ventures with international and national oil companies. We have a robust portfolio of deepwater and onshore acreage across the Americas to ensure sustained production. The Gas Monetization business focuses on ways to leverage Shell’s significant natural gas position in new and existing markets, such as converting natural gas to liquids (GTL) to provide cleaner burning fuels. We are also developers of wind power as a means to generate electricity.  Upstream Americas will invest in developing our existing resource base to sustain profitable core areas, in growing integrated gas positions and new material oil projects and in unlocking additional unconventional oil and gas resources.At Shell our commitment is to satisfy the world’s need for energy with economically, socially and environmentally responsible solutions.  We seek a high standard of performance, and understand that great ideas can change the world.  If you want to work with a group of creative, ambitious and innovative professionals then you should consider Shell.  We will provide you with the resources to put your ideas into action, worldwide opportunities to advance your career, and outstanding benefits and rewards that support your quality of life.  Join us and let’s make a real difference together.    Responsibilities :\\r\\n Responsible for providing support for the overall safety, health, environment performance, security and social performance of Shell’s wind business which includes numerous wind farms across the US and Europe  Provide day to day HSE support to the operating assets including professional advice, job safety analysis, leadership coaching, incident investigation, corrective actions, permit support, etc  Prepare, implement and maintain HSE-Management System including guidelines, procedures and processes  Advise on HSE and sustainable development targets and improvement programs  Develop and implement the annual HSE Plan  Maintain the Hazard Register for operation sites. Periodically re-assess risks, consult HSE team on findings and implement mitigations  Conduct self-audits of operating assets, construction projects and advise teams of findings and follow-up  Facilitate formal HSE audits; develop and implement corrective action plans  Deliver contractor safety management  Perform construction site visits and audits to ensure they maintain a high level of HSE-performance  Assure that HSE is built into business development projects  Provide HSE due diligence processes on acquisitions and joint ventures  Prepare and deliver HSE training courses  Help create a sustainable HSE culture using behavioral safety and leadership tools",
    "Score": 0.7728480101
  },
  "78": {
    "Title": "Drupal Developer",
    "Description": "\\r\\nThis position requires a developer who can help architect and build a publishing platform using Drupal.  The candidate should be strong in CSS, HTML, JavaScript, and PHP (particularly the jQuery framework). Responsibilities include:\\r\\n* Gathering requirements \\r\\n* Site Analysis \\r\\n* Building Custom Themes and Subthemes \\r\\nCross Browser CSS/Styling \\r\\n* Custom DHTML/JavaScript Functionality \\r\\n* Module Selection and Implementation \\r\\n* Module Development \\r\\n\\r\\nIntegration with other services \\r\\n\\r\\nThe position requires autonomous self-starters who can build complete features from end to end while keeping pace with an aggressive schedule.  Development is done using Agile methodologies, so familiarity with Agile is a definite plus.  The developer should work well with feature driven development rather than task driven development.\\r\\n\\r\\nA candidate for this position will need to be strong technically as well as having good problem solving and communication skills, along with the ability to quickly and effectively determine the best solutions.  The candidate should also be able to solve for the problems inherent in building and delivering a high volume, high availability, high profile site with a focus on a consistent and easy to use interface for the editorial user. Familiarity with the challenges in building­­ high volume content management systems is also a plus.\\r\\n \\r\\nQualifications: \\r\\nEDUCATION: Bachelor's degree in Computer Science or equivalent experience.\\r\\nQUALIFICATIONS REQUIRED: 3-5 years experience building and theming Drupal Web sites.  Thorough understanding of Drupal, its capabilities and its limitations. Thorough knowledge of Drupal theme development, site building and module selection, PHP, MySQL, HTML, DHTML, CSS, JavaScript, JQuery.  Strong skills required in critical thinking and analysis. Good written and verbal communication skills. Good interpersonal skills. Attention to details is a must.  Prioritizes multiple tasks effectively.\\r\\nQUALIFICATIONS PREFERRED: Drupal module development.  Experience working with subversion on unix/linux based systems in a team environment.  Experience with Agile/Scrum methodology.\\r\\n\\r\\nRandstad Technologies is an EOE-M/F/V/D and is a wholly owned subsidiary of Randstad Holding nv, a $22.5 billion global provider of HR services and the second largest staffing organization in the world.",
    "Score": 0.7701499462
  },
  "79": {
    "Title": "Cerner Content Review and Design Consultant",
    "Description": "Cerner Content Review and Design Consultant\\rEncore is currently seeking an experienced Cerner Content Review and Design Consultant to join our growing national consulting team.  \\r  \\rResponsibilities:\\r\\r    Review existing training content and create modifications\\r    Review reference guides and Web-based training\\r\\r  \\r \\r \\rNamed one of the 2010 & 2011 Best Places to work by Modern Healthcare, Encore is looking for innovative, talented, motivated and energetic individuals to join our team.   Our true value as an organization lies in our culture and proven leadership. We provide a competitive benefits package including vacation, medical/dental/vision and 401(k).\\rFor more information on our company, please visit us at:\\rwww.encorehealthresources.com\\r ",
    "Score": 0.7679798007
  },
  "80": {
    "Title": "Analytics Manager / Sr. Manager / Director",
    "Description": "We are currently seeking candidates for our growing business who have experience with large data sets and utilizing quantitative techniques for marketing purposes.  This position is accountable for managing client projects, executing project plans through hands-on efforts and management of team members.  \\r\\rUtlitzing knowledge of direct marketing principles and analytic techniques, managers contribute to task planning and are responsible for managing multiple consultants to support the plan.  In addition, managers are expected to contribute to internal goals and initiatives when their time or skillsets are needed.\\r\\rThe individual should be adept at establishing solid client relationships, creating a challenging and rewarding environment for consultants and analysts, and possess strong team-building skills.",
    "Score": 0.765427649
  },
  "81": {
    "Title": "Software Developer - .Net, C#",
    "Description": "Responsibilities: A premier Kforce client is looking for C# .Net Developer for a 3-6 month contract opportunity in Los Angeles, California.  This is an extremely technical environment in which candidates will be surrounded by some of the most talented, fun-spirited, and driven individuals they've worked with.\\r\\n\\r\\nKforce (Nasdaq:KFRC) is a professional staffing and solutions firm providing flexible and permanent staffing solutions in the skill areas of technology, finance & accounting, clinical research and healthcare. Backed by approximately our associates and consultants on assignment, Kforce is committed to \"Great People = Great Results\" for our valued clients and candidates. Kforce operates with 65 offices located throughout the United States and two offices in the Philippines.\\r\\n\\r\\nJob Ref#: 2312~WQG~1157620T1~99",
    "Score": 0.7619404793
  },
  "82": {
    "Title": "Android Developer",
    "Description": "\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\rAndroid Developer \\rResponsibilities:\\r•   Develop robust and user-friendly applications for Android devices\\r•   Assist product managers in validating business requirements. The developer is not directly responsible for creating business requirements but contributes ideas when needed.\\r•   Implement IT specifications based on sound development practices\\r•   Implement unit testing based on development guidelines\\rRequired skills & experience:\\r•   Degree in computer science or related subject is preferred\\r•   Solid grasp of Object-Oriented Programming concepts\\r•   1 or more years of Android development experience\\r•   Experience developing at least one app published in Android Market\\r•   Strong Java core library knowledge\\r•   Experience writing applications that utilize a backend RESTful API\\r•   Good grasp of data structures and algorithms\\r•   Understanding of web technologies and practices such as HTTP, web security\\r•   Demonstrated ability to work with minimal direction\\r•   Ability to independently gather and research needed information\\r•   Ability to document the code\\rPreferred skills & experience:\\r•                     Experience developing internationalized Android applications\\r•                     Familiar with Agile Development (requirements management, storyboarding, incremental change approaches, continuous integration, and structured branching / versioning)\\r•                     Familiar with Eclipse IDE\\r•                     Good understanding of cryptography is a plus \\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r",
    "Score": 0.7616767883
  },
  "83": {
    "Title": "Java Programmer Analyst / Developer",
    "Description": "Our client, located in Woodbridge with a large development team, is looking for a Java Programmer Analyst / Developers to develop in several diverse application areas. This position will be working with inventory applications, procurement, shipping, and financial applications.  Some of the development is moving off of legacy Cobol systems and into a Object Oriented Java environment.",
    "Score": 0.7601183057
  },
  "84": {
    "Title": "Senior PHP Developer",
    "Description": " \\rOur client is an exciting startup in the education services space, seeking a Senior PHP Developer to join their full-time team, working on a web-based software platform. Successful candidates will join the cross-functional software team responsible for integrating the core platform with disparate and highly variable school systems.  You will propose and document software design from an existing code base through requirements analysis and then collaborate on implementation options.  \\r",
    "Score": 0.7600165606
  },
  "85": {
    "Title": "Solid Waste/ Landfill Gas Project Engineer- Tampa,",
    "Description": "Job Classification: Full-Time Regular\\r\\n\\r\\nSenior Project Engineer/Project Engineer SCS Engineers is seeking an engineer to join our Florida solid waste practice, as a key individual in our landfill gas group in the Tampa office.  SCS is an employee-owned environmental consulting firm, recognized as a world leader in solid waste management, solid waste engineering, environmental services and site remediation. The firm was founded in 1970 and employs over 700 professional and support staff located in over 45 offices nationwide. Job Summary/Description  This individual will be working in the Tampa FL office as a Senior Project Engineer or Project Engineer. The successful candidate will perform and/or manage significant work in solid waste engineering projects, particularly in the area of landfill gas (LFG) management, including planning studies; design and permitting; preparation of construction plans and specifications; report writing; general consulting assistance including regulatory compliance; and some CADD, fieldwork, and CQA observation.  Additional project work in studies, engineering, construction, and regulatory compliance for landfills, transfer stations, material recovery facilities, and other solid waste projects is possible.   Job Qualifications & Experience ?         4 to 8 years experience in environmental consulting, preferably solid waste and LFG engineering  ?         Bachelor's degree in environmental, chemical or civil engineering, or related field ?         EIT or PE preferred ?         Demonstrated ability in engineering analysis and design, and strong communication skills. ?         Experience with LFG system compliance with the NSPS of the Clean Air Act is preferred.   ?         Willingness to undertake occasional travel and field work as required. SCS Engineers offers excellent opportunities for career advancement and a competitive compensation package, including: medical, dental, vision, 401K, ESOP, paid holidays and paid vacations. This position is subject to a pre-employment background check, driving record check and drug test based on SCS Engineers workplace policy.  SCS Engineers is an Equal Opportunity Employer. EOE/M/F/D/V",
    "Score": 0.7544358969
  },
  "86": {
    "Title": "Desktop Support/Help Desk Tier III   (Active Secret Clearance)",
    "Description": "ALTA IT Services is a leading full-service staffing firm with over 20 years of experience helping\\rbusinesses succeed through personal selection of contract and contract to hire professionals for\\rInformation Technology, Human Resources and Accounting requirements. ALTA helps businesses\\roptimize recruitment processes and identify the right talent for specific requirements, increasing\\rworkforce efficiency.\\r\\r\\rWe serve a variety of industries in the government, commercial and non-profit sectors with a focus onthe federal government and government-related industries. In support of our government contractorclients, we maintain a top-secret facility clearance. This allows us to help staff highly sensitivegovernment projects by continually recruiting cleared personnel. ALTA is able to initiate, transfer or modify clearances at the Secret and Top Secret levels.\\r\\r\\rALTA IT Services is an Equal Opportunity Employer, M/F/D/V.",
    "Score": 0.7534891367
  },
  "87": {
    "Title": "Lead Programmer / Developer",
    "Description": "\\r\\n      Lead Programmer / \\r\\n      Developer\\r\\n\\r\\n      \\r\\n      Phoenix, AZ                                 Email\\r\\n\\r\\n      Design and develop new functionality of the software using Apache, PHP & MySQL. Duties include the integration of new features, support & maintenance of existing software code base, testing, issues tracking and resolving. Working on new releases and software updates. Require BS in CIS or any related field. 3 yrs relevant work exp. Salary is $76,711.\\r\\n      Job location in Central Phoenix.\\r\\n\\r\\n      Desert Dog Marketing, LLC\\r\\n      jobs@pinnaclecart.com\\r\\n      \\r\\n\\r\\n     Source - Arizona Republic - Phoenix, AZ",
    "Score": 0.7506186962
  },
  "88": {
    "Title": "High Energy Articulate Admin need ASAP!",
    "Description": "Polished and Professional Administrative Assistant needed IMMEDIATELY!\\r\\rWe are looking for a up & coming Admin Assistant with 5 years Admin exp. working in a fast paced environment, (Recent College Grad with solid Admin exp is Ideal)\\rThis is a great opportunity for someone who is looking to get their \"foot in the door\" with a GREAT company and grow.\\rWill be responsible for supporting 2 VP's.\\rCandidates must pro-active and have the ability to \"manage up to managers\"\\rCandidate must be very confident and not intimidated by high powered people,\\rNeeds to be polished, professional yet and be assertive and take charge,\\rA problem solver and can think on your feet.\\r\\rEffective Coordination/Administration \\rProvides a wide variety of administrative and staff support services to 2 VP's.\\rMay coordinate and administer various projects, programs and reports. \\rScreens and directs phone calls.  \\rSchedules meetings/coordinates business travel arrangements. \\r \\r ",
    "Score": 0.7481760383
  },
  "89": {
    "Title": "Digital Specialist Intern FT & PT",
    "Description": "We need Digital Specialists for Full and Part-time positions. This person will need to be familiar with social media, have a strong work ethic, a professional attitude and a desire to excel within a start-up environment. They will work directly with the account management team as a social media instrument for clients.  This position is based in the main office which is located in Scottsdale, AZ and in some cases we may selectively hire this position to be located in other key markets.\\r\\rThis position will perform a variety of different duties to ensure clients receive comprehensive social media.  You will be in charge of establishing and maintaining their online reputation.  The digital specialist will do the behind the scenes work with their account manager acting as the liaison between them and the clients at Digital Air Strike.  This position is responsible for providing daily monitoring and posting for the clients as well as reporting to them their findings.  This position currently reports to the Digital Specialist Supervisor, but this is subject to change.\\r \\rDigital Specialist primary duties include but are not limited to:\\r \\r\\r    Daily monitoring of each client’s review sites and social media sites \\r    Creation of creative daily posts to various social media sites across the internet\\r    Daily emails to clients with updates of the status of their social media environment\\r    Researching relevant social media content and understanding ongoing social media changes and innovations\\r    Researching and developing dealership and brand specific content for posting including: automotive sales and service specials, significant products or amenities the dealership offers, and outstanding achievements or developments by an automotive brand\\r    Building a relationship with your account manager and communicate with them the client’s wants and needs\\r",
    "Score": 0.7469741702
  },
  "90": {
    "Title": "Quality Engineer - RF / Wireless Equipment",
    "Description": "Responsibilities include but are not limited to: \\r- Managing the organization's Quality Management System and QA functions. \\r- Prepare and write SOP's and perform the annual review and update of company SOP's.  \\r- Provide training and review SOP's as needed.  \\r- Coordinate and provide manufacturing related training such as Safety, MSDS, Solder and ESD training programs.  \\r- Perform customer, process and product audits and facilitate the Supplier Assessment Program.  \\r- Perform the calibration recall system, develop manufacturing test plans and act as a liaison between Engineering and Quality for process improvement measures.  \\r- Perform data analysis, assist with training and maintain various quality system logs, metrics and tracking systems.  \\r- Manage personnel within the Quality Assurance group organizing and delegating work associated with regular Quality functions such as incoming and outgoing inspection, finished goods release, supplier questionnaire and certifications, equipment calibrations, internal audits.\\rPosition is with a telecom electronics company.",
    "Score": 0.7431871891
  },
  "91": {
    "Title": "SENIOR JAVA DEVELOPER - Dayton, OH",
    "Description": "The Senior Java Developer will be responsible for designing, developing, and maintaining applications for real-time publishing systems.  You will work in an agile-based environment building creative Internet syndication products using technologies such as Java, Spring, GWT, Solr, MySql, XML, Linux, and RSS.  Come be a part of this team that is changing the way the web works in a fundamental way by providing real time Internet information and infrastructure!  \\r\\rResponsibilities:\\r\\r\\r    Designing, developing, and deploying Java based news and social media applications\\r    Providing architectural input to project-related decisions\\r    Be comfortable functioning as a team lead, working closely with Engineering Manager to coordinate activities for a small team of developers.\\r    Define systems that include both hardware and software components\\r    Work independently with minimum supervision and a geographically dispersed team\\r    Use industry best practices to deliver high quality code \\r\\r\\rTraining: \\rOn-the-job training",
    "Score": 0.7419054508
  },
  "92": {
    "Title": "MS Dynamics GP / Great Plains -Staff Accountant-Dallas-$50-$70K",
    "Description": "Job Description \\r\\n\\r\\nMS Dynamics GP / Great Plains –Staff Accountant – Dallas – $50-$70K \\r\\n\\r\\nLeading Energy Company is looking for an experienced Staff Accountant in MS Dynamics GP / Great Plains to join the growing team within the End User.  More resources are needed immediately to manage the growing of the organization.\\r\\n\\r\\nThis opportunity will play a large role in the expansion of the use of MS Dynamics GP / Great Plains with responsibilities that include. \\r\\n•Reconcile inventory, including balance sheet account reconciliation. Report analyses to management and recommend corrective action if/as appropriate.\\r\\n•Work with logistics to develop appropriate treatment of inventory flow and processing, especially on new products.\\r\\n•Maintain inventory standard costs.\\r\\n•Reconcile Cost of Goods Sold, including but not limited to, PPV. Report analyses to management and recommend corrective action if/as appropriate.\\r\\n•Work with A/P to resolve issues with vendors\\r\\n\\r\\nIdeal Candidates for this role will utilize the following Skills and Experience\\r\\n•At least 1 year of MS Dynamics GP / Great Plains experience.\\r\\n•Need to the have the understand of Crystal report writer\\r\\n•Ability to read, analyze, and interpret general business periodicals, professional journals, technical procedures, or governmental regulations. \\r\\n•Ability to write reports, business correspondence, and procedure manuals. \\r\\n•Ability to effectively present information and respond to questions from groups of managers, clients, customers, and the general public.\\r\\n\\r\\nThis is a great opportunity for a Staff Accountant to work for a growing MS Dynamics GP / Great Plains end user to continue expand their knowledge with a great team environment with a ton of growth potential.  \\r\\n\\r\\nThe company has a large amount of benefits including Two weeks paid vacation, Medical, Vision, Dental, matching 401K.\\r\\n\\r\\nThis company is looking to fill positions ASAP so if you have MS Dynamics GP / Great Plains experience please APPLY NOW and call Dustin at 212-731-8272.\\r\\n\\r\\nNigel Frank International is the global leader for Microsoft Dynamics recruitment, advertising more Dynamics GP/ Great Plains jobs than any other agency. We deal with both Microsoft Partners & End Users throughout North America. By specializing solely in placing candidates in the Microsoft Dynamics market I have built relationships with most of the key employers in North America and have an unrivalled understanding of where the best opportunities and MS Dynamics GP/ Great Plains jobs are. \\r\\n\\r\\nI understand the need for discretion and would welcome the opportunity to speak to any Microsoft MS Dynamics GP / Great Plains candidates that are considering a new career or job either now or in the future. Confidentiality is of course guaranteed. For information on the Microsoft Dynamics market and some of the opportunities and MS Dynamics GP / Great Plains jobs that are available I can be contacted on 1-212-731-8272. Please see www.nigelfrank.com for more fantastic Microsoft Dynamics opportunities! \\r\\n\\r\\nNigel Frank International Inc. is acting as an Employment Agency in relation to this vacancy",
    "Score": 0.7411314249
  },
  "93": {
    "Title": "Junior SQL Developer",
    "Description": "\\rWork with other IT resources to:\\r \\r\\r    Understand project goals & requirements\\r    Develop and maintain programs throughout their life-cycle\\r    \\r        Design specification\\r        Testing\\r        Implementation\\r        On-going support\\r    \\r    \\r    Customer support\\r    \\r        Define customer issues\\r        Test solutions\\r        Implement solutions\\r    \\r    \\r\\r\\r    Manage and  create the following in MS SQL Server environment\\r    \\r        Tables\\r        Views\\r        Indexes\\r        Stored procedures\\r        Triggers\\r    \\r    \\r",
    "Score": 0.740526557
  },
  "94": {
    "Title": "Audio / Video Technician",
    "Description": "An educational publisher and consulting partner, providing technology-based products, services, and professional personnel assets for schools, state departments of education, institutions of learning, and select businesses is searching for a Audio / Video Technician for its office in Ball Ground, Georgia\\r\\r\\rMain Job Duties:\\r\\r\\r    Upkeep and mainteance of Promethean Boards and A/V equipment. \\r    Changing bulbs in projectors, doing some minor VGA cabling and any other maintenance\\r    Upkeep duties involved with A/V equipment (mainly interactive whiteboards.) \\r",
    "Score": 0.74037534
  },
  "95": {
    "Title": "Sr. Embedded Software Engineer",
    "Description": "Volt's Defense Industry Contractor has a position open for a Sr. Embedded Software Engineer who will be performing software requirements analysis.\\r\\nJob Responsibilities:\\r\\nWork will be conducted at 50% in an office environment and 50% in a lab environment.\\r\\nDevelop software preliminary and detail design utilizing software design tools as specified by department standards.\\r\\nDevelop code to implement software design.  Code development shall conform to department standards and procedures. Primarily embedded C/C++.\\r\\nPerform Hardware/Software Integration and Unit Test.\\r\\nDevelop and maintain software in accordance with the project SDP and CMMI Level 5 processes.\\r\\nPrepare status reports to management and support design/code reviews.\\r\\nInterface with other GDLS departments and business units.\\r\\nInterface with other program partners outside of GDLS.\\r\\nDevelop and deliver presentations to customers and management.\\r\\nLead and mentor Jr. Engineers.\\r\\nThis is an estimated 1+ year Contingent/Temporary position in Sterling Heights, MI and offered through Volt Technical Resources, headquartered in Scottsdale, AZ. We are among the largest staffing companies in the US for contingent/temporary and direct hire placements, and support most of the top-rated companies in the USA.\\r\\nPlease Note: Must be Currently Available and Authorized to Work for Any Company in the USA.  Local Candidates are Encouraged to Apply! Please no Corp to Corp, Recruiting Agency or Subcontracting Company responses at this time. ",
    "Score": 0.7390829325
  },
  "96": {
    "Title": "Senior Oracle Database Administrator (Full time)",
    "Description": "Our client, located in Union, NJ is seeking a Senior Oracle Database Administrator for an immediate full-time position. Details include: We are seeking an Oracle Application DBA who can provide high quality support for the production, test, and development environments by implementing, managing, monitoring and maintaining multiple database servers and databases. This person should be able to analyze and study complex application/database requirements to proactively design, plan, and deploy needed capabilities. The ideal candidate will have the ability to work independently or under only general direction in a fast-paced and flexible environment with tight deadlines and changing priorities. The ability to effectively troubleshoot system problems by identifying and implementing software or process changes that allow business applications to operate with minimal risk is a must. This person should demonstrate experience with business process implementation in the design and implementation of systems and using database management systems and their integration and should have a good understanding of the entire SDLC process, including specification, documentation, and quality assurance.   Principle Areas of Responsibility:-Performing the daily checks as part of a predefined routine while supporting the database projects related activities-Performance monitoring and capacity planning, database installation and configuration, database backup & recovery, patch upgrades, security compliance, audit trail monitoring-Research, evaluate, test and new software and DBMS related tools and facilities as they pertain to the existing DBMS environment, database designs, procedures, and applications-Schedule and coordinate database maintenance activities including such items as database reorganizations and restructures-Participate in on-call and off-hours production problem resolution activities-Evaluates all systems for enhancements design, develop and maintain databases that interact with software applications.-Work on enterprise applications integration efforts and validate of associated work products-Administer all database objects, including tables, indexes, views, sequences, procedures, and packages  Requirements:-Extensive DBA experience using Oracle Database 11g and 10g,-Experience in software development and working with developers on a regular basis.-Be able to provide data manipulations in the context of applications running against the databases.-Ability to perform Oracle system performance monitoring and the necessary adjustments.-Ability to reverse-engineer databases, applications utilizing the databases, and the applications??? business processes. Requirements:-5 - 10 years of experience in Oracle Database administration-Experience supporting Oracle Financials R12-Experience working with Oracle Application Server 10G and 6i.-Ability to perform Oracle system performance monitoring and the necessary adjustments.-Experience supporting systems in a Unix environment, preferably Linux-Experience supporting Oracle Financials is preferred  Ask our Talon Technology Occupational Consultants about our Referral Bonus Program. ",
    "Score": 0.7380916476
  },
  "97": {
    "Title": "Jr. Java Developer",
    "Description": "Position Summary:\\r \\rLooking for a hard working self-starter who wants to learn more and do more. The ideal candidate will be one who is willing to take ownership of project goals and rise to the challenge of delivering cutting edge software with technologies that may push the boundaries of their current skill set.  Candidates are expected to work well as part of a team and also perform at a high level on individual tasks.  This is not a maintenance position.  Candidates will be developing new software systems as part of a rapid development organization.  This is an opportunity to leverage your existing skills and grow new ones around Web 2.0 and big data technologies. \\r\\r ",
    "Score": 0.7374380231
  },
  "98": {
    "Title": "$104K Sr. Software Engineer -Be On The Cutting Edge!!",
    "Description": "an experienced Software Developer who specializes in ASP.Net this could be the position you are looking for!  You will be participating in the full development cycle, working with a highly technical team to maximize system effectiveness designing new solutions as they create new problems!\\r\\n\\r\\nIf youre looking for an amazing company, with great benefits and wonderful co-workers then this could be the position for you!  Be part of the cutting edge in software development with this company who is aggressively seeking a Sr. Software Engineer!!!   Do you bring more to the table than simply one or two languages and a degree?  Preference will be given to the person who is comfortable working in an Agile development environment, who is comfortable with ecommerce development and who has demonstrated above average leadership skills and attention to detail. Are you ready to seriously get to work doing what you love???\\r\\nDoes making $104K annually, facing daily challenges, and working in a dynamic environment appeal to you?  If so, apply today!!  We are an equal employment opportunity employer.",
    "Score": 0.7358688712
  },
  "99": {
    "Title": "NOC Help Desk Technician - Cisco Routers",
    "Description": "\\rNOC Center Technician\\r  \\rA national IT Telecommunications Solutions Firm has an immediate opening for a CCNA-level NOC Technician to join their 24 / 7 / 365 Network Operations Center in Orlando, FL.\\r  \\rSCOPE OF POSITION \\r \\rThe Network Operations Center First Call Response Technician is team member responsible for round-the-clock monitoring of customer equipment utilizing applications such as NetCool, Zenoss, NetIQ, EMC Smarts, and Service-now. These applications are used to ensure customer monitored equipment is up and operational. \\r\\rThe FCR Technician will be the primary point of contact for all customers and Sentry personnel, with the intent of resolving most customer related issues. The candidate will be expected to interact with customers, peers and management via phone, IM, video, and email to ensure customer issues are resolved per contracted SLA’s.\\r  \\rSPECIFIC RESPONSIBILITIES \\r \\r•         Primary Point of Contact for customer events.\\r•         Monitor the progress of events and providing timely updates to customers, engineers, \\r   vendors and management.\\r•         Perform basic Cisco Call Manager and Unity Systems Administration.\\r•         Perform basic Route/Switch administration.\\r•         Perform basic systems diagnosis/troubleshooting\\r•         Coordinate and escalate complex issues to escalation Team when necessary.\\r•         Work with peers and management to resolve technical issues and questions for \\r  customers.\\r•         Document incident communication, and update customers regularly on ongoing \\r  incidents. Provide full report of issues to management.\\r•         Provide thorough report of customer-facing issues and provide report to escalation \\r  teams.\\r•         Continue to learn and enhance technical skills to provide better customer support and \\r  service.\\r \\r  \\r  \\r",
    "Score": 0.7346990705
  }
}